espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/mipi_dsi_host_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** DSI_HOST_VERSION_REG register
 *  NA
 */
#define DSI_HOST_VERSION_REG (DR_REG_DSI_HOST_BASE + 0x0)
/** DSI_HOST_VERSION : RO; bitpos: [31:0]; default: 825504042;
 *  NA
 */
#define DSI_HOST_VERSION    0xFFFFFFFFU
#define DSI_HOST_VERSION_M  (DSI_HOST_VERSION_V << DSI_HOST_VERSION_S)
#define DSI_HOST_VERSION_V  0xFFFFFFFFU
#define DSI_HOST_VERSION_S  0

/** DSI_HOST_PWR_UP_REG register
 *  NA
 */
#define DSI_HOST_PWR_UP_REG (DR_REG_DSI_HOST_BASE + 0x4)
/** DSI_HOST_SHUTDOWNZ : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define DSI_HOST_SHUTDOWNZ    (BIT(0))
#define DSI_HOST_SHUTDOWNZ_M  (DSI_HOST_SHUTDOWNZ_V << DSI_HOST_SHUTDOWNZ_S)
#define DSI_HOST_SHUTDOWNZ_V  0x00000001U
#define DSI_HOST_SHUTDOWNZ_S  0

/** DSI_HOST_CLKMGR_CFG_REG register
 *  NA
 */
#define DSI_HOST_CLKMGR_CFG_REG (DR_REG_DSI_HOST_BASE + 0x8)
/** DSI_HOST_TX_ESC_CLK_DIVISION : R/W; bitpos: [7:0]; default: 0;
 *  NA
 */
#define DSI_HOST_TX_ESC_CLK_DIVISION    0x000000FFU
#define DSI_HOST_TX_ESC_CLK_DIVISION_M  (DSI_HOST_TX_ESC_CLK_DIVISION_V << DSI_HOST_TX_ESC_CLK_DIVISION_S)
#define DSI_HOST_TX_ESC_CLK_DIVISION_V  0x000000FFU
#define DSI_HOST_TX_ESC_CLK_DIVISION_S  0
/** DSI_HOST_TO_CLK_DIVISION : R/W; bitpos: [15:8]; default: 0;
 *  NA
 */
#define DSI_HOST_TO_CLK_DIVISION    0x000000FFU
#define DSI_HOST_TO_CLK_DIVISION_M  (DSI_HOST_TO_CLK_DIVISION_V << DSI_HOST_TO_CLK_DIVISION_S)
#define DSI_HOST_TO_CLK_DIVISION_V  0x000000FFU
#define DSI_HOST_TO_CLK_DIVISION_S  8

/** DSI_HOST_DPI_VCID_REG register
 *  NA
 */
#define DSI_HOST_DPI_VCID_REG (DR_REG_DSI_HOST_BASE + 0xc)
/** DSI_HOST_DPI_VCID : R/W; bitpos: [1:0]; default: 0;
 *  NA
 */
#define DSI_HOST_DPI_VCID    0x00000003U
#define DSI_HOST_DPI_VCID_M  (DSI_HOST_DPI_VCID_V << DSI_HOST_DPI_VCID_S)
#define DSI_HOST_DPI_VCID_V  0x00000003U
#define DSI_HOST_DPI_VCID_S  0

/** DSI_HOST_DPI_COLOR_CODING_REG register
 *  NA
 */
#define DSI_HOST_DPI_COLOR_CODING_REG (DR_REG_DSI_HOST_BASE + 0x10)
/** DSI_HOST_DPI_COLOR_CODING : R/W; bitpos: [3:0]; default: 0;
 *  NA
 */
#define DSI_HOST_DPI_COLOR_CODING    0x0000000FU
#define DSI_HOST_DPI_COLOR_CODING_M  (DSI_HOST_DPI_COLOR_CODING_V << DSI_HOST_DPI_COLOR_CODING_S)
#define DSI_HOST_DPI_COLOR_CODING_V  0x0000000FU
#define DSI_HOST_DPI_COLOR_CODING_S  0
/** DSI_HOST_LOOSELY18_EN : R/W; bitpos: [8]; default: 0;
 *  NA
 */
#define DSI_HOST_LOOSELY18_EN    (BIT(8))
#define DSI_HOST_LOOSELY18_EN_M  (DSI_HOST_LOOSELY18_EN_V << DSI_HOST_LOOSELY18_EN_S)
#define DSI_HOST_LOOSELY18_EN_V  0x00000001U
#define DSI_HOST_LOOSELY18_EN_S  8

/** DSI_HOST_DPI_CFG_POL_REG register
 *  NA
 */
#define DSI_HOST_DPI_CFG_POL_REG (DR_REG_DSI_HOST_BASE + 0x14)
/** DSI_HOST_DATAEN_ACTIVE_LOW : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define DSI_HOST_DATAEN_ACTIVE_LOW    (BIT(0))
#define DSI_HOST_DATAEN_ACTIVE_LOW_M  (DSI_HOST_DATAEN_ACTIVE_LOW_V << DSI_HOST_DATAEN_ACTIVE_LOW_S)
#define DSI_HOST_DATAEN_ACTIVE_LOW_V  0x00000001U
#define DSI_HOST_DATAEN_ACTIVE_LOW_S  0
/** DSI_HOST_VSYNC_ACTIVE_LOW : R/W; bitpos: [1]; default: 0;
 *  NA
 */
#define DSI_HOST_VSYNC_ACTIVE_LOW    (BIT(1))
#define DSI_HOST_VSYNC_ACTIVE_LOW_M  (DSI_HOST_VSYNC_ACTIVE_LOW_V << DSI_HOST_VSYNC_ACTIVE_LOW_S)
#define DSI_HOST_VSYNC_ACTIVE_LOW_V  0x00000001U
#define DSI_HOST_VSYNC_ACTIVE_LOW_S  1
/** DSI_HOST_HSYNC_ACTIVE_LOW : R/W; bitpos: [2]; default: 0;
 *  NA
 */
#define DSI_HOST_HSYNC_ACTIVE_LOW    (BIT(2))
#define DSI_HOST_HSYNC_ACTIVE_LOW_M  (DSI_HOST_HSYNC_ACTIVE_LOW_V << DSI_HOST_HSYNC_ACTIVE_LOW_S)
#define DSI_HOST_HSYNC_ACTIVE_LOW_V  0x00000001U
#define DSI_HOST_HSYNC_ACTIVE_LOW_S  2
/** DSI_HOST_SHUTD_ACTIVE_LOW : R/W; bitpos: [3]; default: 0;
 *  NA
 */
#define DSI_HOST_SHUTD_ACTIVE_LOW    (BIT(3))
#define DSI_HOST_SHUTD_ACTIVE_LOW_M  (DSI_HOST_SHUTD_ACTIVE_LOW_V << DSI_HOST_SHUTD_ACTIVE_LOW_S)
#define DSI_HOST_SHUTD_ACTIVE_LOW_V  0x00000001U
#define DSI_HOST_SHUTD_ACTIVE_LOW_S  3
/** DSI_HOST_COLORM_ACTIVE_LOW : R/W; bitpos: [4]; default: 0;
 *  NA
 */
#define DSI_HOST_COLORM_ACTIVE_LOW    (BIT(4))
#define DSI_HOST_COLORM_ACTIVE_LOW_M  (DSI_HOST_COLORM_ACTIVE_LOW_V << DSI_HOST_COLORM_ACTIVE_LOW_S)
#define DSI_HOST_COLORM_ACTIVE_LOW_V  0x00000001U
#define DSI_HOST_COLORM_ACTIVE_LOW_S  4

/** DSI_HOST_DPI_LP_CMD_TIM_REG register
 *  NA
 */
#define DSI_HOST_DPI_LP_CMD_TIM_REG (DR_REG_DSI_HOST_BASE + 0x18)
/** DSI_HOST_INVACT_LPCMD_TIME : R/W; bitpos: [7:0]; default: 0;
 *  NA
 */
#define DSI_HOST_INVACT_LPCMD_TIME    0x000000FFU
#define DSI_HOST_INVACT_LPCMD_TIME_M  (DSI_HOST_INVACT_LPCMD_TIME_V << DSI_HOST_INVACT_LPCMD_TIME_S)
#define DSI_HOST_INVACT_LPCMD_TIME_V  0x000000FFU
#define DSI_HOST_INVACT_LPCMD_TIME_S  0
/** DSI_HOST_OUTVACT_LPCMD_TIME : R/W; bitpos: [23:16]; default: 0;
 *  NA
 */
#define DSI_HOST_OUTVACT_LPCMD_TIME    0x000000FFU
#define DSI_HOST_OUTVACT_LPCMD_TIME_M  (DSI_HOST_OUTVACT_LPCMD_TIME_V << DSI_HOST_OUTVACT_LPCMD_TIME_S)
#define DSI_HOST_OUTVACT_LPCMD_TIME_V  0x000000FFU
#define DSI_HOST_OUTVACT_LPCMD_TIME_S  16

/** DSI_HOST_DBI_VCID_REG register
 *  NA
 */
#define DSI_HOST_DBI_VCID_REG (DR_REG_DSI_HOST_BASE + 0x1c)
/** DSI_HOST_DBI_VCID : R/W; bitpos: [1:0]; default: 0;
 *  NA
 */
#define DSI_HOST_DBI_VCID    0x00000003U
#define DSI_HOST_DBI_VCID_M  (DSI_HOST_DBI_VCID_V << DSI_HOST_DBI_VCID_S)
#define DSI_HOST_DBI_VCID_V  0x00000003U
#define DSI_HOST_DBI_VCID_S  0

/** DSI_HOST_DBI_CFG_REG register
 *  NA
 */
#define DSI_HOST_DBI_CFG_REG (DR_REG_DSI_HOST_BASE + 0x20)
/** DSI_HOST_IN_DBI_CONF : R/W; bitpos: [3:0]; default: 0;
 *  NA
 */
#define DSI_HOST_IN_DBI_CONF    0x0000000FU
#define DSI_HOST_IN_DBI_CONF_M  (DSI_HOST_IN_DBI_CONF_V << DSI_HOST_IN_DBI_CONF_S)
#define DSI_HOST_IN_DBI_CONF_V  0x0000000FU
#define DSI_HOST_IN_DBI_CONF_S  0
/** DSI_HOST_OUT_DBI_CONF : R/W; bitpos: [11:8]; default: 0;
 *  NA
 */
#define DSI_HOST_OUT_DBI_CONF    0x0000000FU
#define DSI_HOST_OUT_DBI_CONF_M  (DSI_HOST_OUT_DBI_CONF_V << DSI_HOST_OUT_DBI_CONF_S)
#define DSI_HOST_OUT_DBI_CONF_V  0x0000000FU
#define DSI_HOST_OUT_DBI_CONF_S  8
/** DSI_HOST_LUT_SIZE_CONF : R/W; bitpos: [17:16]; default: 0;
 *  NA
 */
#define DSI_HOST_LUT_SIZE_CONF    0x00000003U
#define DSI_HOST_LUT_SIZE_CONF_M  (DSI_HOST_LUT_SIZE_CONF_V << DSI_HOST_LUT_SIZE_CONF_S)
#define DSI_HOST_LUT_SIZE_CONF_V  0x00000003U
#define DSI_HOST_LUT_SIZE_CONF_S  16

/** DSI_HOST_DBI_PARTITIONING_EN_REG register
 *  NA
 */
#define DSI_HOST_DBI_PARTITIONING_EN_REG (DR_REG_DSI_HOST_BASE + 0x24)
/** DSI_HOST_PARTITIONING_EN : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define DSI_HOST_PARTITIONING_EN    (BIT(0))
#define DSI_HOST_PARTITIONING_EN_M  (DSI_HOST_PARTITIONING_EN_V << DSI_HOST_PARTITIONING_EN_S)
#define DSI_HOST_PARTITIONING_EN_V  0x00000001U
#define DSI_HOST_PARTITIONING_EN_S  0

