espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/mipi_dsi_host_reg.h
/** DSI_HOST_DBI_CMDSIZE_REG register
 *  NA
 */
#define DSI_HOST_DBI_CMDSIZE_REG (DR_REG_DSI_HOST_BASE + 0x28)
/** DSI_HOST_WR_CMD_SIZE : R/W; bitpos: [15:0]; default: 0;
 *  NA
 */
#define DSI_HOST_WR_CMD_SIZE    0x0000FFFFU
#define DSI_HOST_WR_CMD_SIZE_M  (DSI_HOST_WR_CMD_SIZE_V << DSI_HOST_WR_CMD_SIZE_S)
#define DSI_HOST_WR_CMD_SIZE_V  0x0000FFFFU
#define DSI_HOST_WR_CMD_SIZE_S  0
/** DSI_HOST_ALLOWED_CMD_SIZE : R/W; bitpos: [31:16]; default: 0;
 *  NA
 */
#define DSI_HOST_ALLOWED_CMD_SIZE    0x0000FFFFU
#define DSI_HOST_ALLOWED_CMD_SIZE_M  (DSI_HOST_ALLOWED_CMD_SIZE_V << DSI_HOST_ALLOWED_CMD_SIZE_S)
#define DSI_HOST_ALLOWED_CMD_SIZE_V  0x0000FFFFU
#define DSI_HOST_ALLOWED_CMD_SIZE_S  16

/** DSI_HOST_PCKHDL_CFG_REG register
 *  NA
 */
#define DSI_HOST_PCKHDL_CFG_REG (DR_REG_DSI_HOST_BASE + 0x2c)
/** DSI_HOST_EOTP_TX_EN : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define DSI_HOST_EOTP_TX_EN    (BIT(0))
#define DSI_HOST_EOTP_TX_EN_M  (DSI_HOST_EOTP_TX_EN_V << DSI_HOST_EOTP_TX_EN_S)
#define DSI_HOST_EOTP_TX_EN_V  0x00000001U
#define DSI_HOST_EOTP_TX_EN_S  0
/** DSI_HOST_EOTP_RX_EN : R/W; bitpos: [1]; default: 0;
 *  NA
 */
#define DSI_HOST_EOTP_RX_EN    (BIT(1))
#define DSI_HOST_EOTP_RX_EN_M  (DSI_HOST_EOTP_RX_EN_V << DSI_HOST_EOTP_RX_EN_S)
#define DSI_HOST_EOTP_RX_EN_V  0x00000001U
#define DSI_HOST_EOTP_RX_EN_S  1
/** DSI_HOST_BTA_EN : R/W; bitpos: [2]; default: 0;
 *  NA
 */
#define DSI_HOST_BTA_EN    (BIT(2))
#define DSI_HOST_BTA_EN_M  (DSI_HOST_BTA_EN_V << DSI_HOST_BTA_EN_S)
#define DSI_HOST_BTA_EN_V  0x00000001U
#define DSI_HOST_BTA_EN_S  2
/** DSI_HOST_ECC_RX_EN : R/W; bitpos: [3]; default: 0;
 *  NA
 */
#define DSI_HOST_ECC_RX_EN    (BIT(3))
#define DSI_HOST_ECC_RX_EN_M  (DSI_HOST_ECC_RX_EN_V << DSI_HOST_ECC_RX_EN_S)
#define DSI_HOST_ECC_RX_EN_V  0x00000001U
#define DSI_HOST_ECC_RX_EN_S  3
/** DSI_HOST_CRC_RX_EN : R/W; bitpos: [4]; default: 0;
 *  NA
 */
#define DSI_HOST_CRC_RX_EN    (BIT(4))
#define DSI_HOST_CRC_RX_EN_M  (DSI_HOST_CRC_RX_EN_V << DSI_HOST_CRC_RX_EN_S)
#define DSI_HOST_CRC_RX_EN_V  0x00000001U
#define DSI_HOST_CRC_RX_EN_S  4
/** DSI_HOST_EOTP_TX_LP_EN : R/W; bitpos: [5]; default: 0;
 *  NA
 */
#define DSI_HOST_EOTP_TX_LP_EN    (BIT(5))
#define DSI_HOST_EOTP_TX_LP_EN_M  (DSI_HOST_EOTP_TX_LP_EN_V << DSI_HOST_EOTP_TX_LP_EN_S)
#define DSI_HOST_EOTP_TX_LP_EN_V  0x00000001U
#define DSI_HOST_EOTP_TX_LP_EN_S  5

/** DSI_HOST_GEN_VCID_REG register
 *  NA
 */
#define DSI_HOST_GEN_VCID_REG (DR_REG_DSI_HOST_BASE + 0x30)
/** DSI_HOST_GEN_VCID_RX : R/W; bitpos: [1:0]; default: 0;
 *  NA
 */
#define DSI_HOST_GEN_VCID_RX    0x00000003U
#define DSI_HOST_GEN_VCID_RX_M  (DSI_HOST_GEN_VCID_RX_V << DSI_HOST_GEN_VCID_RX_S)
#define DSI_HOST_GEN_VCID_RX_V  0x00000003U
#define DSI_HOST_GEN_VCID_RX_S  0
/** DSI_HOST_GEN_VCID_TEAR_AUTO : R/W; bitpos: [9:8]; default: 0;
 *  NA
 */
#define DSI_HOST_GEN_VCID_TEAR_AUTO    0x00000003U
#define DSI_HOST_GEN_VCID_TEAR_AUTO_M  (DSI_HOST_GEN_VCID_TEAR_AUTO_V << DSI_HOST_GEN_VCID_TEAR_AUTO_S)
#define DSI_HOST_GEN_VCID_TEAR_AUTO_V  0x00000003U
#define DSI_HOST_GEN_VCID_TEAR_AUTO_S  8
/** DSI_HOST_GEN_VCID_TX_AUTO : R/W; bitpos: [17:16]; default: 0;
 *  NA
 */
#define DSI_HOST_GEN_VCID_TX_AUTO    0x00000003U
#define DSI_HOST_GEN_VCID_TX_AUTO_M  (DSI_HOST_GEN_VCID_TX_AUTO_V << DSI_HOST_GEN_VCID_TX_AUTO_S)
#define DSI_HOST_GEN_VCID_TX_AUTO_V  0x00000003U
#define DSI_HOST_GEN_VCID_TX_AUTO_S  16

/** DSI_HOST_MODE_CFG_REG register
 *  NA
 */
#define DSI_HOST_MODE_CFG_REG (DR_REG_DSI_HOST_BASE + 0x34)
/** DSI_HOST_CMD_VIDEO_MODE : R/W; bitpos: [0]; default: 1;
 *  NA
 */
#define DSI_HOST_CMD_VIDEO_MODE    (BIT(0))
#define DSI_HOST_CMD_VIDEO_MODE_M  (DSI_HOST_CMD_VIDEO_MODE_V << DSI_HOST_CMD_VIDEO_MODE_S)
#define DSI_HOST_CMD_VIDEO_MODE_V  0x00000001U
#define DSI_HOST_CMD_VIDEO_MODE_S  0

/** DSI_HOST_VID_MODE_CFG_REG register
 *  NA
 */
#define DSI_HOST_VID_MODE_CFG_REG (DR_REG_DSI_HOST_BASE + 0x38)
/** DSI_HOST_VID_MODE_TYPE : R/W; bitpos: [1:0]; default: 0;
 *  NA
 */
#define DSI_HOST_VID_MODE_TYPE    0x00000003U
#define DSI_HOST_VID_MODE_TYPE_M  (DSI_HOST_VID_MODE_TYPE_V << DSI_HOST_VID_MODE_TYPE_S)
#define DSI_HOST_VID_MODE_TYPE_V  0x00000003U
#define DSI_HOST_VID_MODE_TYPE_S  0
/** DSI_HOST_LP_VSA_EN : R/W; bitpos: [8]; default: 0;
 *  NA
 */
#define DSI_HOST_LP_VSA_EN    (BIT(8))
#define DSI_HOST_LP_VSA_EN_M  (DSI_HOST_LP_VSA_EN_V << DSI_HOST_LP_VSA_EN_S)
#define DSI_HOST_LP_VSA_EN_V  0x00000001U
#define DSI_HOST_LP_VSA_EN_S  8
/** DSI_HOST_LP_VBP_EN : R/W; bitpos: [9]; default: 0;
 *  NA
 */
#define DSI_HOST_LP_VBP_EN    (BIT(9))
#define DSI_HOST_LP_VBP_EN_M  (DSI_HOST_LP_VBP_EN_V << DSI_HOST_LP_VBP_EN_S)
#define DSI_HOST_LP_VBP_EN_V  0x00000001U
#define DSI_HOST_LP_VBP_EN_S  9
/** DSI_HOST_LP_VFP_EN : R/W; bitpos: [10]; default: 0;
 *  NA
 */
#define DSI_HOST_LP_VFP_EN    (BIT(10))
#define DSI_HOST_LP_VFP_EN_M  (DSI_HOST_LP_VFP_EN_V << DSI_HOST_LP_VFP_EN_S)
#define DSI_HOST_LP_VFP_EN_V  0x00000001U
#define DSI_HOST_LP_VFP_EN_S  10
/** DSI_HOST_LP_VACT_EN : R/W; bitpos: [11]; default: 0;
 *  NA
 */
#define DSI_HOST_LP_VACT_EN    (BIT(11))
#define DSI_HOST_LP_VACT_EN_M  (DSI_HOST_LP_VACT_EN_V << DSI_HOST_LP_VACT_EN_S)
#define DSI_HOST_LP_VACT_EN_V  0x00000001U
#define DSI_HOST_LP_VACT_EN_S  11
/** DSI_HOST_LP_HBP_EN : R/W; bitpos: [12]; default: 0;
 *  NA
 */
#define DSI_HOST_LP_HBP_EN    (BIT(12))
#define DSI_HOST_LP_HBP_EN_M  (DSI_HOST_LP_HBP_EN_V << DSI_HOST_LP_HBP_EN_S)
#define DSI_HOST_LP_HBP_EN_V  0x00000001U
#define DSI_HOST_LP_HBP_EN_S  12
/** DSI_HOST_LP_HFP_EN : R/W; bitpos: [13]; default: 0;
 *  NA
 */
#define DSI_HOST_LP_HFP_EN    (BIT(13))
#define DSI_HOST_LP_HFP_EN_M  (DSI_HOST_LP_HFP_EN_V << DSI_HOST_LP_HFP_EN_S)
#define DSI_HOST_LP_HFP_EN_V  0x00000001U
#define DSI_HOST_LP_HFP_EN_S  13
/** DSI_HOST_FRAME_BTA_ACK_EN : R/W; bitpos: [14]; default: 0;
 *  NA
 */
#define DSI_HOST_FRAME_BTA_ACK_EN    (BIT(14))
#define DSI_HOST_FRAME_BTA_ACK_EN_M  (DSI_HOST_FRAME_BTA_ACK_EN_V << DSI_HOST_FRAME_BTA_ACK_EN_S)
#define DSI_HOST_FRAME_BTA_ACK_EN_V  0x00000001U
#define DSI_HOST_FRAME_BTA_ACK_EN_S  14
/** DSI_HOST_LP_CMD_EN : R/W; bitpos: [15]; default: 0;
 *  NA
 */
#define DSI_HOST_LP_CMD_EN    (BIT(15))
#define DSI_HOST_LP_CMD_EN_M  (DSI_HOST_LP_CMD_EN_V << DSI_HOST_LP_CMD_EN_S)
#define DSI_HOST_LP_CMD_EN_V  0x00000001U
#define DSI_HOST_LP_CMD_EN_S  15
/** DSI_HOST_VPG_EN : R/W; bitpos: [16]; default: 0;
 *  NA
 */
#define DSI_HOST_VPG_EN    (BIT(16))
#define DSI_HOST_VPG_EN_M  (DSI_HOST_VPG_EN_V << DSI_HOST_VPG_EN_S)
#define DSI_HOST_VPG_EN_V  0x00000001U
#define DSI_HOST_VPG_EN_S  16
/** DSI_HOST_VPG_MODE : R/W; bitpos: [20]; default: 0;
 *  NA
 */
#define DSI_HOST_VPG_MODE    (BIT(20))
#define DSI_HOST_VPG_MODE_M  (DSI_HOST_VPG_MODE_V << DSI_HOST_VPG_MODE_S)
#define DSI_HOST_VPG_MODE_V  0x00000001U
#define DSI_HOST_VPG_MODE_S  20
/** DSI_HOST_VPG_ORIENTATION : R/W; bitpos: [24]; default: 0;
 *  NA
 */
#define DSI_HOST_VPG_ORIENTATION    (BIT(24))
#define DSI_HOST_VPG_ORIENTATION_M  (DSI_HOST_VPG_ORIENTATION_V << DSI_HOST_VPG_ORIENTATION_S)
#define DSI_HOST_VPG_ORIENTATION_V  0x00000001U
#define DSI_HOST_VPG_ORIENTATION_S  24

/** DSI_HOST_VID_PKT_SIZE_REG register
 *  NA
 */
#define DSI_HOST_VID_PKT_SIZE_REG (DR_REG_DSI_HOST_BASE + 0x3c)
/** DSI_HOST_VID_PKT_SIZE : R/W; bitpos: [13:0]; default: 0;
 *  NA
 */
#define DSI_HOST_VID_PKT_SIZE    0x00003FFFU
#define DSI_HOST_VID_PKT_SIZE_M  (DSI_HOST_VID_PKT_SIZE_V << DSI_HOST_VID_PKT_SIZE_S)
#define DSI_HOST_VID_PKT_SIZE_V  0x00003FFFU
#define DSI_HOST_VID_PKT_SIZE_S  0

/** DSI_HOST_VID_NUM_CHUNKS_REG register
 *  NA
 */
#define DSI_HOST_VID_NUM_CHUNKS_REG (DR_REG_DSI_HOST_BASE + 0x40)
/** DSI_HOST_VID_NUM_CHUNKS : R/W; bitpos: [12:0]; default: 0;
 *  NA
 */
#define DSI_HOST_VID_NUM_CHUNKS    0x00001FFFU
#define DSI_HOST_VID_NUM_CHUNKS_M  (DSI_HOST_VID_NUM_CHUNKS_V << DSI_HOST_VID_NUM_CHUNKS_S)
#define DSI_HOST_VID_NUM_CHUNKS_V  0x00001FFFU
#define DSI_HOST_VID_NUM_CHUNKS_S  0

