espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/mipi_dsi_host_reg.h
/** DSI_HOST_VID_NULL_SIZE_REG register
 *  NA
 */
#define DSI_HOST_VID_NULL_SIZE_REG (DR_REG_DSI_HOST_BASE + 0x44)
/** DSI_HOST_VID_NULL_SIZE : R/W; bitpos: [12:0]; default: 0;
 *  NA
 */
#define DSI_HOST_VID_NULL_SIZE    0x00001FFFU
#define DSI_HOST_VID_NULL_SIZE_M  (DSI_HOST_VID_NULL_SIZE_V << DSI_HOST_VID_NULL_SIZE_S)
#define DSI_HOST_VID_NULL_SIZE_V  0x00001FFFU
#define DSI_HOST_VID_NULL_SIZE_S  0

/** DSI_HOST_VID_HSA_TIME_REG register
 *  NA
 */
#define DSI_HOST_VID_HSA_TIME_REG (DR_REG_DSI_HOST_BASE + 0x48)
/** DSI_HOST_VID_HSA_TIME : R/W; bitpos: [11:0]; default: 0;
 *  NA
 */
#define DSI_HOST_VID_HSA_TIME    0x00000FFFU
#define DSI_HOST_VID_HSA_TIME_M  (DSI_HOST_VID_HSA_TIME_V << DSI_HOST_VID_HSA_TIME_S)
#define DSI_HOST_VID_HSA_TIME_V  0x00000FFFU
#define DSI_HOST_VID_HSA_TIME_S  0

/** DSI_HOST_VID_HBP_TIME_REG register
 *  NA
 */
#define DSI_HOST_VID_HBP_TIME_REG (DR_REG_DSI_HOST_BASE + 0x4c)
/** DSI_HOST_VID_HBP_TIME : R/W; bitpos: [11:0]; default: 0;
 *  NA
 */
#define DSI_HOST_VID_HBP_TIME    0x00000FFFU
#define DSI_HOST_VID_HBP_TIME_M  (DSI_HOST_VID_HBP_TIME_V << DSI_HOST_VID_HBP_TIME_S)
#define DSI_HOST_VID_HBP_TIME_V  0x00000FFFU
#define DSI_HOST_VID_HBP_TIME_S  0

/** DSI_HOST_VID_HLINE_TIME_REG register
 *  NA
 */
#define DSI_HOST_VID_HLINE_TIME_REG (DR_REG_DSI_HOST_BASE + 0x50)
/** DSI_HOST_VID_HLINE_TIME : R/W; bitpos: [14:0]; default: 0;
 *  NA
 */
#define DSI_HOST_VID_HLINE_TIME    0x00007FFFU
#define DSI_HOST_VID_HLINE_TIME_M  (DSI_HOST_VID_HLINE_TIME_V << DSI_HOST_VID_HLINE_TIME_S)
#define DSI_HOST_VID_HLINE_TIME_V  0x00007FFFU
#define DSI_HOST_VID_HLINE_TIME_S  0

/** DSI_HOST_VID_VSA_LINES_REG register
 *  NA
 */
#define DSI_HOST_VID_VSA_LINES_REG (DR_REG_DSI_HOST_BASE + 0x54)
/** DSI_HOST_VSA_LINES : R/W; bitpos: [9:0]; default: 0;
 *  NA
 */
#define DSI_HOST_VSA_LINES    0x000003FFU
#define DSI_HOST_VSA_LINES_M  (DSI_HOST_VSA_LINES_V << DSI_HOST_VSA_LINES_S)
#define DSI_HOST_VSA_LINES_V  0x000003FFU
#define DSI_HOST_VSA_LINES_S  0

/** DSI_HOST_VID_VBP_LINES_REG register
 *  NA
 */
#define DSI_HOST_VID_VBP_LINES_REG (DR_REG_DSI_HOST_BASE + 0x58)
/** DSI_HOST_VBP_LINES : R/W; bitpos: [9:0]; default: 0;
 *  NA
 */
#define DSI_HOST_VBP_LINES    0x000003FFU
#define DSI_HOST_VBP_LINES_M  (DSI_HOST_VBP_LINES_V << DSI_HOST_VBP_LINES_S)
#define DSI_HOST_VBP_LINES_V  0x000003FFU
#define DSI_HOST_VBP_LINES_S  0

/** DSI_HOST_VID_VFP_LINES_REG register
 *  NA
 */
#define DSI_HOST_VID_VFP_LINES_REG (DR_REG_DSI_HOST_BASE + 0x5c)
/** DSI_HOST_VFP_LINES : R/W; bitpos: [9:0]; default: 0;
 *  NA
 */
#define DSI_HOST_VFP_LINES    0x000003FFU
#define DSI_HOST_VFP_LINES_M  (DSI_HOST_VFP_LINES_V << DSI_HOST_VFP_LINES_S)
#define DSI_HOST_VFP_LINES_V  0x000003FFU
#define DSI_HOST_VFP_LINES_S  0

/** DSI_HOST_VID_VACTIVE_LINES_REG register
 *  NA
 */
#define DSI_HOST_VID_VACTIVE_LINES_REG (DR_REG_DSI_HOST_BASE + 0x60)
/** DSI_HOST_V_ACTIVE_LINES : R/W; bitpos: [13:0]; default: 0;
 *  NA
 */
#define DSI_HOST_V_ACTIVE_LINES    0x00003FFFU
#define DSI_HOST_V_ACTIVE_LINES_M  (DSI_HOST_V_ACTIVE_LINES_V << DSI_HOST_V_ACTIVE_LINES_S)
#define DSI_HOST_V_ACTIVE_LINES_V  0x00003FFFU
#define DSI_HOST_V_ACTIVE_LINES_S  0

/** DSI_HOST_EDPI_CMD_SIZE_REG register
 *  NA
 */
#define DSI_HOST_EDPI_CMD_SIZE_REG (DR_REG_DSI_HOST_BASE + 0x64)
/** DSI_HOST_EDPI_ALLOWED_CMD_SIZE : R/W; bitpos: [15:0]; default: 0;
 *  NA
 */
#define DSI_HOST_EDPI_ALLOWED_CMD_SIZE    0x0000FFFFU
#define DSI_HOST_EDPI_ALLOWED_CMD_SIZE_M  (DSI_HOST_EDPI_ALLOWED_CMD_SIZE_V << DSI_HOST_EDPI_ALLOWED_CMD_SIZE_S)
#define DSI_HOST_EDPI_ALLOWED_CMD_SIZE_V  0x0000FFFFU
#define DSI_HOST_EDPI_ALLOWED_CMD_SIZE_S  0

/** DSI_HOST_CMD_MODE_CFG_REG register
 *  NA
 */
#define DSI_HOST_CMD_MODE_CFG_REG (DR_REG_DSI_HOST_BASE + 0x68)
/** DSI_HOST_TEAR_FX_EN : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define DSI_HOST_TEAR_FX_EN    (BIT(0))
#define DSI_HOST_TEAR_FX_EN_M  (DSI_HOST_TEAR_FX_EN_V << DSI_HOST_TEAR_FX_EN_S)
#define DSI_HOST_TEAR_FX_EN_V  0x00000001U
#define DSI_HOST_TEAR_FX_EN_S  0
/** DSI_HOST_ACK_RQST_EN : R/W; bitpos: [1]; default: 0;
 *  NA
 */
#define DSI_HOST_ACK_RQST_EN    (BIT(1))
#define DSI_HOST_ACK_RQST_EN_M  (DSI_HOST_ACK_RQST_EN_V << DSI_HOST_ACK_RQST_EN_S)
#define DSI_HOST_ACK_RQST_EN_V  0x00000001U
#define DSI_HOST_ACK_RQST_EN_S  1
/** DSI_HOST_GEN_SW_0P_TX : R/W; bitpos: [8]; default: 0;
 *  NA
 */
#define DSI_HOST_GEN_SW_0P_TX    (BIT(8))
#define DSI_HOST_GEN_SW_0P_TX_M  (DSI_HOST_GEN_SW_0P_TX_V << DSI_HOST_GEN_SW_0P_TX_S)
#define DSI_HOST_GEN_SW_0P_TX_V  0x00000001U
#define DSI_HOST_GEN_SW_0P_TX_S  8
/** DSI_HOST_GEN_SW_1P_TX : R/W; bitpos: [9]; default: 0;
 *  NA
 */
#define DSI_HOST_GEN_SW_1P_TX    (BIT(9))
#define DSI_HOST_GEN_SW_1P_TX_M  (DSI_HOST_GEN_SW_1P_TX_V << DSI_HOST_GEN_SW_1P_TX_S)
#define DSI_HOST_GEN_SW_1P_TX_V  0x00000001U
#define DSI_HOST_GEN_SW_1P_TX_S  9
/** DSI_HOST_GEN_SW_2P_TX : R/W; bitpos: [10]; default: 0;
 *  NA
 */
#define DSI_HOST_GEN_SW_2P_TX    (BIT(10))
#define DSI_HOST_GEN_SW_2P_TX_M  (DSI_HOST_GEN_SW_2P_TX_V << DSI_HOST_GEN_SW_2P_TX_S)
#define DSI_HOST_GEN_SW_2P_TX_V  0x00000001U
#define DSI_HOST_GEN_SW_2P_TX_S  10
/** DSI_HOST_GEN_SR_0P_TX : R/W; bitpos: [11]; default: 0;
 *  NA
 */
#define DSI_HOST_GEN_SR_0P_TX    (BIT(11))
#define DSI_HOST_GEN_SR_0P_TX_M  (DSI_HOST_GEN_SR_0P_TX_V << DSI_HOST_GEN_SR_0P_TX_S)
#define DSI_HOST_GEN_SR_0P_TX_V  0x00000001U
#define DSI_HOST_GEN_SR_0P_TX_S  11
/** DSI_HOST_GEN_SR_1P_TX : R/W; bitpos: [12]; default: 0;
 *  NA
 */
#define DSI_HOST_GEN_SR_1P_TX    (BIT(12))
#define DSI_HOST_GEN_SR_1P_TX_M  (DSI_HOST_GEN_SR_1P_TX_V << DSI_HOST_GEN_SR_1P_TX_S)
#define DSI_HOST_GEN_SR_1P_TX_V  0x00000001U
#define DSI_HOST_GEN_SR_1P_TX_S  12
/** DSI_HOST_GEN_SR_2P_TX : R/W; bitpos: [13]; default: 0;
 *  NA
 */
#define DSI_HOST_GEN_SR_2P_TX    (BIT(13))
#define DSI_HOST_GEN_SR_2P_TX_M  (DSI_HOST_GEN_SR_2P_TX_V << DSI_HOST_GEN_SR_2P_TX_S)
#define DSI_HOST_GEN_SR_2P_TX_V  0x00000001U
#define DSI_HOST_GEN_SR_2P_TX_S  13
/** DSI_HOST_GEN_LW_TX : R/W; bitpos: [14]; default: 0;
 *  NA
 */
#define DSI_HOST_GEN_LW_TX    (BIT(14))
#define DSI_HOST_GEN_LW_TX_M  (DSI_HOST_GEN_LW_TX_V << DSI_HOST_GEN_LW_TX_S)
#define DSI_HOST_GEN_LW_TX_V  0x00000001U
#define DSI_HOST_GEN_LW_TX_S  14
/** DSI_HOST_DCS_SW_0P_TX : R/W; bitpos: [16]; default: 0;
 *  NA
 */
#define DSI_HOST_DCS_SW_0P_TX    (BIT(16))
#define DSI_HOST_DCS_SW_0P_TX_M  (DSI_HOST_DCS_SW_0P_TX_V << DSI_HOST_DCS_SW_0P_TX_S)
#define DSI_HOST_DCS_SW_0P_TX_V  0x00000001U
#define DSI_HOST_DCS_SW_0P_TX_S  16
/** DSI_HOST_DCS_SW_1P_TX : R/W; bitpos: [17]; default: 0;
 *  NA
 */
#define DSI_HOST_DCS_SW_1P_TX    (BIT(17))
#define DSI_HOST_DCS_SW_1P_TX_M  (DSI_HOST_DCS_SW_1P_TX_V << DSI_HOST_DCS_SW_1P_TX_S)
#define DSI_HOST_DCS_SW_1P_TX_V  0x00000001U
#define DSI_HOST_DCS_SW_1P_TX_S  17
/** DSI_HOST_DCS_SR_0P_TX : R/W; bitpos: [18]; default: 0;
 *  NA
 */
#define DSI_HOST_DCS_SR_0P_TX    (BIT(18))
#define DSI_HOST_DCS_SR_0P_TX_M  (DSI_HOST_DCS_SR_0P_TX_V << DSI_HOST_DCS_SR_0P_TX_S)
#define DSI_HOST_DCS_SR_0P_TX_V  0x00000001U
#define DSI_HOST_DCS_SR_0P_TX_S  18
/** DSI_HOST_DCS_LW_TX : R/W; bitpos: [19]; default: 0;
 *  NA
 */
#define DSI_HOST_DCS_LW_TX    (BIT(19))
#define DSI_HOST_DCS_LW_TX_M  (DSI_HOST_DCS_LW_TX_V << DSI_HOST_DCS_LW_TX_S)
#define DSI_HOST_DCS_LW_TX_V  0x00000001U
#define DSI_HOST_DCS_LW_TX_S  19
/** DSI_HOST_MAX_RD_PKT_SIZE : R/W; bitpos: [24]; default: 0;
 *  NA
 */
#define DSI_HOST_MAX_RD_PKT_SIZE    (BIT(24))
#define DSI_HOST_MAX_RD_PKT_SIZE_M  (DSI_HOST_MAX_RD_PKT_SIZE_V << DSI_HOST_MAX_RD_PKT_SIZE_S)
#define DSI_HOST_MAX_RD_PKT_SIZE_V  0x00000001U
#define DSI_HOST_MAX_RD_PKT_SIZE_S  24

