espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/mipi_dsi_host_reg.h
/** DSI_HOST_GEN_HDR_REG register
 *  NA
 */
#define DSI_HOST_GEN_HDR_REG (DR_REG_DSI_HOST_BASE + 0x6c)
/** DSI_HOST_GEN_DT : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define DSI_HOST_GEN_DT    0x0000003FU
#define DSI_HOST_GEN_DT_M  (DSI_HOST_GEN_DT_V << DSI_HOST_GEN_DT_S)
#define DSI_HOST_GEN_DT_V  0x0000003FU
#define DSI_HOST_GEN_DT_S  0
/** DSI_HOST_GEN_VC : R/W; bitpos: [7:6]; default: 0;
 *  NA
 */
#define DSI_HOST_GEN_VC    0x00000003U
#define DSI_HOST_GEN_VC_M  (DSI_HOST_GEN_VC_V << DSI_HOST_GEN_VC_S)
#define DSI_HOST_GEN_VC_V  0x00000003U
#define DSI_HOST_GEN_VC_S  6
/** DSI_HOST_GEN_WC_LSBYTE : R/W; bitpos: [15:8]; default: 0;
 *  NA
 */
#define DSI_HOST_GEN_WC_LSBYTE    0x000000FFU
#define DSI_HOST_GEN_WC_LSBYTE_M  (DSI_HOST_GEN_WC_LSBYTE_V << DSI_HOST_GEN_WC_LSBYTE_S)
#define DSI_HOST_GEN_WC_LSBYTE_V  0x000000FFU
#define DSI_HOST_GEN_WC_LSBYTE_S  8
/** DSI_HOST_GEN_WC_MSBYTE : R/W; bitpos: [23:16]; default: 0;
 *  NA
 */
#define DSI_HOST_GEN_WC_MSBYTE    0x000000FFU
#define DSI_HOST_GEN_WC_MSBYTE_M  (DSI_HOST_GEN_WC_MSBYTE_V << DSI_HOST_GEN_WC_MSBYTE_S)
#define DSI_HOST_GEN_WC_MSBYTE_V  0x000000FFU
#define DSI_HOST_GEN_WC_MSBYTE_S  16

/** DSI_HOST_GEN_PLD_DATA_REG register
 *  NA
 */
#define DSI_HOST_GEN_PLD_DATA_REG (DR_REG_DSI_HOST_BASE + 0x70)
/** DSI_HOST_GEN_PLD_B1 : R/W; bitpos: [7:0]; default: 0;
 *  NA
 */
#define DSI_HOST_GEN_PLD_B1    0x000000FFU
#define DSI_HOST_GEN_PLD_B1_M  (DSI_HOST_GEN_PLD_B1_V << DSI_HOST_GEN_PLD_B1_S)
#define DSI_HOST_GEN_PLD_B1_V  0x000000FFU
#define DSI_HOST_GEN_PLD_B1_S  0
/** DSI_HOST_GEN_PLD_B2 : R/W; bitpos: [15:8]; default: 0;
 *  NA
 */
#define DSI_HOST_GEN_PLD_B2    0x000000FFU
#define DSI_HOST_GEN_PLD_B2_M  (DSI_HOST_GEN_PLD_B2_V << DSI_HOST_GEN_PLD_B2_S)
#define DSI_HOST_GEN_PLD_B2_V  0x000000FFU
#define DSI_HOST_GEN_PLD_B2_S  8
/** DSI_HOST_GEN_PLD_B3 : R/W; bitpos: [23:16]; default: 0;
 *  NA
 */
#define DSI_HOST_GEN_PLD_B3    0x000000FFU
#define DSI_HOST_GEN_PLD_B3_M  (DSI_HOST_GEN_PLD_B3_V << DSI_HOST_GEN_PLD_B3_S)
#define DSI_HOST_GEN_PLD_B3_V  0x000000FFU
#define DSI_HOST_GEN_PLD_B3_S  16
/** DSI_HOST_GEN_PLD_B4 : R/W; bitpos: [31:24]; default: 0;
 *  NA
 */
#define DSI_HOST_GEN_PLD_B4    0x000000FFU
#define DSI_HOST_GEN_PLD_B4_M  (DSI_HOST_GEN_PLD_B4_V << DSI_HOST_GEN_PLD_B4_S)
#define DSI_HOST_GEN_PLD_B4_V  0x000000FFU
#define DSI_HOST_GEN_PLD_B4_S  24

/** DSI_HOST_CMD_PKT_STATUS_REG register
 *  NA
 */
#define DSI_HOST_CMD_PKT_STATUS_REG (DR_REG_DSI_HOST_BASE + 0x74)
/** DSI_HOST_GEN_CMD_EMPTY : RO; bitpos: [0]; default: 1;
 *  NA
 */
#define DSI_HOST_GEN_CMD_EMPTY    (BIT(0))
#define DSI_HOST_GEN_CMD_EMPTY_M  (DSI_HOST_GEN_CMD_EMPTY_V << DSI_HOST_GEN_CMD_EMPTY_S)
#define DSI_HOST_GEN_CMD_EMPTY_V  0x00000001U
#define DSI_HOST_GEN_CMD_EMPTY_S  0
/** DSI_HOST_GEN_CMD_FULL : RO; bitpos: [1]; default: 0;
 *  NA
 */
#define DSI_HOST_GEN_CMD_FULL    (BIT(1))
#define DSI_HOST_GEN_CMD_FULL_M  (DSI_HOST_GEN_CMD_FULL_V << DSI_HOST_GEN_CMD_FULL_S)
#define DSI_HOST_GEN_CMD_FULL_V  0x00000001U
#define DSI_HOST_GEN_CMD_FULL_S  1
/** DSI_HOST_GEN_PLD_W_EMPTY : RO; bitpos: [2]; default: 1;
 *  NA
 */
#define DSI_HOST_GEN_PLD_W_EMPTY    (BIT(2))
#define DSI_HOST_GEN_PLD_W_EMPTY_M  (DSI_HOST_GEN_PLD_W_EMPTY_V << DSI_HOST_GEN_PLD_W_EMPTY_S)
#define DSI_HOST_GEN_PLD_W_EMPTY_V  0x00000001U
#define DSI_HOST_GEN_PLD_W_EMPTY_S  2
/** DSI_HOST_GEN_PLD_W_FULL : RO; bitpos: [3]; default: 0;
 *  NA
 */
#define DSI_HOST_GEN_PLD_W_FULL    (BIT(3))
#define DSI_HOST_GEN_PLD_W_FULL_M  (DSI_HOST_GEN_PLD_W_FULL_V << DSI_HOST_GEN_PLD_W_FULL_S)
#define DSI_HOST_GEN_PLD_W_FULL_V  0x00000001U
#define DSI_HOST_GEN_PLD_W_FULL_S  3
/** DSI_HOST_GEN_PLD_R_EMPTY : RO; bitpos: [4]; default: 1;
 *  NA
 */
#define DSI_HOST_GEN_PLD_R_EMPTY    (BIT(4))
#define DSI_HOST_GEN_PLD_R_EMPTY_M  (DSI_HOST_GEN_PLD_R_EMPTY_V << DSI_HOST_GEN_PLD_R_EMPTY_S)
#define DSI_HOST_GEN_PLD_R_EMPTY_V  0x00000001U
#define DSI_HOST_GEN_PLD_R_EMPTY_S  4
/** DSI_HOST_GEN_PLD_R_FULL : RO; bitpos: [5]; default: 0;
 *  NA
 */
#define DSI_HOST_GEN_PLD_R_FULL    (BIT(5))
#define DSI_HOST_GEN_PLD_R_FULL_M  (DSI_HOST_GEN_PLD_R_FULL_V << DSI_HOST_GEN_PLD_R_FULL_S)
#define DSI_HOST_GEN_PLD_R_FULL_V  0x00000001U
#define DSI_HOST_GEN_PLD_R_FULL_S  5
/** DSI_HOST_GEN_RD_CMD_BUSY : RO; bitpos: [6]; default: 0;
 *  NA
 */
#define DSI_HOST_GEN_RD_CMD_BUSY    (BIT(6))
#define DSI_HOST_GEN_RD_CMD_BUSY_M  (DSI_HOST_GEN_RD_CMD_BUSY_V << DSI_HOST_GEN_RD_CMD_BUSY_S)
#define DSI_HOST_GEN_RD_CMD_BUSY_V  0x00000001U
#define DSI_HOST_GEN_RD_CMD_BUSY_S  6
/** DSI_HOST_GEN_BUFF_CMD_EMPTY : RO; bitpos: [16]; default: 1;
 *  NA
 */
#define DSI_HOST_GEN_BUFF_CMD_EMPTY    (BIT(16))
#define DSI_HOST_GEN_BUFF_CMD_EMPTY_M  (DSI_HOST_GEN_BUFF_CMD_EMPTY_V << DSI_HOST_GEN_BUFF_CMD_EMPTY_S)
#define DSI_HOST_GEN_BUFF_CMD_EMPTY_V  0x00000001U
#define DSI_HOST_GEN_BUFF_CMD_EMPTY_S  16
/** DSI_HOST_GEN_BUFF_CMD_FULL : RO; bitpos: [17]; default: 0;
 *  NA
 */
#define DSI_HOST_GEN_BUFF_CMD_FULL    (BIT(17))
#define DSI_HOST_GEN_BUFF_CMD_FULL_M  (DSI_HOST_GEN_BUFF_CMD_FULL_V << DSI_HOST_GEN_BUFF_CMD_FULL_S)
#define DSI_HOST_GEN_BUFF_CMD_FULL_V  0x00000001U
#define DSI_HOST_GEN_BUFF_CMD_FULL_S  17
/** DSI_HOST_GEN_BUFF_PLD_EMPTY : RO; bitpos: [18]; default: 1;
 *  NA
 */
#define DSI_HOST_GEN_BUFF_PLD_EMPTY    (BIT(18))
#define DSI_HOST_GEN_BUFF_PLD_EMPTY_M  (DSI_HOST_GEN_BUFF_PLD_EMPTY_V << DSI_HOST_GEN_BUFF_PLD_EMPTY_S)
#define DSI_HOST_GEN_BUFF_PLD_EMPTY_V  0x00000001U
#define DSI_HOST_GEN_BUFF_PLD_EMPTY_S  18
/** DSI_HOST_GEN_BUFF_PLD_FULL : RO; bitpos: [19]; default: 0;
 *  NA
 */
#define DSI_HOST_GEN_BUFF_PLD_FULL    (BIT(19))
#define DSI_HOST_GEN_BUFF_PLD_FULL_M  (DSI_HOST_GEN_BUFF_PLD_FULL_V << DSI_HOST_GEN_BUFF_PLD_FULL_S)
#define DSI_HOST_GEN_BUFF_PLD_FULL_V  0x00000001U
#define DSI_HOST_GEN_BUFF_PLD_FULL_S  19

/** DSI_HOST_TO_CNT_CFG_REG register
 *  NA
 */
#define DSI_HOST_TO_CNT_CFG_REG (DR_REG_DSI_HOST_BASE + 0x78)
/** DSI_HOST_LPRX_TO_CNT : R/W; bitpos: [15:0]; default: 0;
 *  NA
 */
#define DSI_HOST_LPRX_TO_CNT    0x0000FFFFU
#define DSI_HOST_LPRX_TO_CNT_M  (DSI_HOST_LPRX_TO_CNT_V << DSI_HOST_LPRX_TO_CNT_S)
#define DSI_HOST_LPRX_TO_CNT_V  0x0000FFFFU
#define DSI_HOST_LPRX_TO_CNT_S  0
/** DSI_HOST_HSTX_TO_CNT : R/W; bitpos: [31:16]; default: 0;
 *  NA
 */
#define DSI_HOST_HSTX_TO_CNT    0x0000FFFFU
#define DSI_HOST_HSTX_TO_CNT_M  (DSI_HOST_HSTX_TO_CNT_V << DSI_HOST_HSTX_TO_CNT_S)
#define DSI_HOST_HSTX_TO_CNT_V  0x0000FFFFU
#define DSI_HOST_HSTX_TO_CNT_S  16

/** DSI_HOST_HS_RD_TO_CNT_REG register
 *  NA
 */
#define DSI_HOST_HS_RD_TO_CNT_REG (DR_REG_DSI_HOST_BASE + 0x7c)
/** DSI_HOST_HS_RD_TO_CNT : R/W; bitpos: [15:0]; default: 0;
 *  NA
 */
#define DSI_HOST_HS_RD_TO_CNT    0x0000FFFFU
#define DSI_HOST_HS_RD_TO_CNT_M  (DSI_HOST_HS_RD_TO_CNT_V << DSI_HOST_HS_RD_TO_CNT_S)
#define DSI_HOST_HS_RD_TO_CNT_V  0x0000FFFFU
#define DSI_HOST_HS_RD_TO_CNT_S  0

/** DSI_HOST_LP_RD_TO_CNT_REG register
 *  NA
 */
#define DSI_HOST_LP_RD_TO_CNT_REG (DR_REG_DSI_HOST_BASE + 0x80)
/** DSI_HOST_LP_RD_TO_CNT : R/W; bitpos: [15:0]; default: 0;
 *  NA
 */
#define DSI_HOST_LP_RD_TO_CNT    0x0000FFFFU
#define DSI_HOST_LP_RD_TO_CNT_M  (DSI_HOST_LP_RD_TO_CNT_V << DSI_HOST_LP_RD_TO_CNT_S)
#define DSI_HOST_LP_RD_TO_CNT_V  0x0000FFFFU
#define DSI_HOST_LP_RD_TO_CNT_S  0

/** DSI_HOST_HS_WR_TO_CNT_REG register
 *  NA
 */
#define DSI_HOST_HS_WR_TO_CNT_REG (DR_REG_DSI_HOST_BASE + 0x84)
/** DSI_HOST_HS_WR_TO_CNT : R/W; bitpos: [15:0]; default: 0;
 *  NA
 */
#define DSI_HOST_HS_WR_TO_CNT    0x0000FFFFU
#define DSI_HOST_HS_WR_TO_CNT_M  (DSI_HOST_HS_WR_TO_CNT_V << DSI_HOST_HS_WR_TO_CNT_S)
#define DSI_HOST_HS_WR_TO_CNT_V  0x0000FFFFU
#define DSI_HOST_HS_WR_TO_CNT_S  0

