espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/mipi_dsi_host_reg.h
/** DSI_HOST_LP_WR_TO_CNT_REG register
 *  NA
 */
#define DSI_HOST_LP_WR_TO_CNT_REG (DR_REG_DSI_HOST_BASE + 0x88)
/** DSI_HOST_LP_WR_TO_CNT : R/W; bitpos: [15:0]; default: 0;
 *  NA
 */
#define DSI_HOST_LP_WR_TO_CNT    0x0000FFFFU
#define DSI_HOST_LP_WR_TO_CNT_M  (DSI_HOST_LP_WR_TO_CNT_V << DSI_HOST_LP_WR_TO_CNT_S)
#define DSI_HOST_LP_WR_TO_CNT_V  0x0000FFFFU
#define DSI_HOST_LP_WR_TO_CNT_S  0

/** DSI_HOST_BTA_TO_CNT_REG register
 *  NA
 */
#define DSI_HOST_BTA_TO_CNT_REG (DR_REG_DSI_HOST_BASE + 0x8c)
/** DSI_HOST_BTA_TO_CNT : R/W; bitpos: [15:0]; default: 0;
 *  NA
 */
#define DSI_HOST_BTA_TO_CNT    0x0000FFFFU
#define DSI_HOST_BTA_TO_CNT_M  (DSI_HOST_BTA_TO_CNT_V << DSI_HOST_BTA_TO_CNT_S)
#define DSI_HOST_BTA_TO_CNT_V  0x0000FFFFU
#define DSI_HOST_BTA_TO_CNT_S  0

/** DSI_HOST_SDF_3D_REG register
 *  NA
 */
#define DSI_HOST_SDF_3D_REG (DR_REG_DSI_HOST_BASE + 0x90)
/** DSI_HOST_MODE_3D : R/W; bitpos: [1:0]; default: 0;
 *  NA
 */
#define DSI_HOST_MODE_3D    0x00000003U
#define DSI_HOST_MODE_3D_M  (DSI_HOST_MODE_3D_V << DSI_HOST_MODE_3D_S)
#define DSI_HOST_MODE_3D_V  0x00000003U
#define DSI_HOST_MODE_3D_S  0
/** DSI_HOST_FORMAT_3D : R/W; bitpos: [3:2]; default: 0;
 *  NA
 */
#define DSI_HOST_FORMAT_3D    0x00000003U
#define DSI_HOST_FORMAT_3D_M  (DSI_HOST_FORMAT_3D_V << DSI_HOST_FORMAT_3D_S)
#define DSI_HOST_FORMAT_3D_V  0x00000003U
#define DSI_HOST_FORMAT_3D_S  2
/** DSI_HOST_SECOND_VSYNC : R/W; bitpos: [4]; default: 0;
 *  NA
 */
#define DSI_HOST_SECOND_VSYNC    (BIT(4))
#define DSI_HOST_SECOND_VSYNC_M  (DSI_HOST_SECOND_VSYNC_V << DSI_HOST_SECOND_VSYNC_S)
#define DSI_HOST_SECOND_VSYNC_V  0x00000001U
#define DSI_HOST_SECOND_VSYNC_S  4
/** DSI_HOST_RIGHT_FIRST : R/W; bitpos: [5]; default: 0;
 *  NA
 */
#define DSI_HOST_RIGHT_FIRST    (BIT(5))
#define DSI_HOST_RIGHT_FIRST_M  (DSI_HOST_RIGHT_FIRST_V << DSI_HOST_RIGHT_FIRST_S)
#define DSI_HOST_RIGHT_FIRST_V  0x00000001U
#define DSI_HOST_RIGHT_FIRST_S  5
/** DSI_HOST_SEND_3D_CFG : R/W; bitpos: [16]; default: 0;
 *  NA
 */
#define DSI_HOST_SEND_3D_CFG    (BIT(16))
#define DSI_HOST_SEND_3D_CFG_M  (DSI_HOST_SEND_3D_CFG_V << DSI_HOST_SEND_3D_CFG_S)
#define DSI_HOST_SEND_3D_CFG_V  0x00000001U
#define DSI_HOST_SEND_3D_CFG_S  16

/** DSI_HOST_LPCLK_CTRL_REG register
 *  NA
 */
#define DSI_HOST_LPCLK_CTRL_REG (DR_REG_DSI_HOST_BASE + 0x94)
/** DSI_HOST_PHY_TXREQUESTCLKHS : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define DSI_HOST_PHY_TXREQUESTCLKHS    (BIT(0))
#define DSI_HOST_PHY_TXREQUESTCLKHS_M  (DSI_HOST_PHY_TXREQUESTCLKHS_V << DSI_HOST_PHY_TXREQUESTCLKHS_S)
#define DSI_HOST_PHY_TXREQUESTCLKHS_V  0x00000001U
#define DSI_HOST_PHY_TXREQUESTCLKHS_S  0
/** DSI_HOST_AUTO_CLKLANE_CTRL : R/W; bitpos: [1]; default: 0;
 *  NA
 */
#define DSI_HOST_AUTO_CLKLANE_CTRL    (BIT(1))
#define DSI_HOST_AUTO_CLKLANE_CTRL_M  (DSI_HOST_AUTO_CLKLANE_CTRL_V << DSI_HOST_AUTO_CLKLANE_CTRL_S)
#define DSI_HOST_AUTO_CLKLANE_CTRL_V  0x00000001U
#define DSI_HOST_AUTO_CLKLANE_CTRL_S  1

/** DSI_HOST_PHY_TMR_LPCLK_CFG_REG register
 *  NA
 */
#define DSI_HOST_PHY_TMR_LPCLK_CFG_REG (DR_REG_DSI_HOST_BASE + 0x98)
/** DSI_HOST_PHY_CLKLP2HS_TIME : R/W; bitpos: [9:0]; default: 0;
 *  NA
 */
#define DSI_HOST_PHY_CLKLP2HS_TIME    0x000003FFU
#define DSI_HOST_PHY_CLKLP2HS_TIME_M  (DSI_HOST_PHY_CLKLP2HS_TIME_V << DSI_HOST_PHY_CLKLP2HS_TIME_S)
#define DSI_HOST_PHY_CLKLP2HS_TIME_V  0x000003FFU
#define DSI_HOST_PHY_CLKLP2HS_TIME_S  0
/** DSI_HOST_PHY_CLKHS2LP_TIME : R/W; bitpos: [25:16]; default: 0;
 *  NA
 */
#define DSI_HOST_PHY_CLKHS2LP_TIME    0x000003FFU
#define DSI_HOST_PHY_CLKHS2LP_TIME_M  (DSI_HOST_PHY_CLKHS2LP_TIME_V << DSI_HOST_PHY_CLKHS2LP_TIME_S)
#define DSI_HOST_PHY_CLKHS2LP_TIME_V  0x000003FFU
#define DSI_HOST_PHY_CLKHS2LP_TIME_S  16

/** DSI_HOST_PHY_TMR_CFG_REG register
 *  NA
 */
#define DSI_HOST_PHY_TMR_CFG_REG (DR_REG_DSI_HOST_BASE + 0x9c)
/** DSI_HOST_PHY_LP2HS_TIME : R/W; bitpos: [9:0]; default: 0;
 *  NA
 */
#define DSI_HOST_PHY_LP2HS_TIME    0x000003FFU
#define DSI_HOST_PHY_LP2HS_TIME_M  (DSI_HOST_PHY_LP2HS_TIME_V << DSI_HOST_PHY_LP2HS_TIME_S)
#define DSI_HOST_PHY_LP2HS_TIME_V  0x000003FFU
#define DSI_HOST_PHY_LP2HS_TIME_S  0
/** DSI_HOST_PHY_HS2LP_TIME : R/W; bitpos: [25:16]; default: 0;
 *  NA
 */
#define DSI_HOST_PHY_HS2LP_TIME    0x000003FFU
#define DSI_HOST_PHY_HS2LP_TIME_M  (DSI_HOST_PHY_HS2LP_TIME_V << DSI_HOST_PHY_HS2LP_TIME_S)
#define DSI_HOST_PHY_HS2LP_TIME_V  0x000003FFU
#define DSI_HOST_PHY_HS2LP_TIME_S  16

/** DSI_HOST_PHY_RSTZ_REG register
 *  NA
 */
#define DSI_HOST_PHY_RSTZ_REG (DR_REG_DSI_HOST_BASE + 0xa0)
/** DSI_HOST_PHY_SHUTDOWNZ : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define DSI_HOST_PHY_SHUTDOWNZ    (BIT(0))
#define DSI_HOST_PHY_SHUTDOWNZ_M  (DSI_HOST_PHY_SHUTDOWNZ_V << DSI_HOST_PHY_SHUTDOWNZ_S)
#define DSI_HOST_PHY_SHUTDOWNZ_V  0x00000001U
#define DSI_HOST_PHY_SHUTDOWNZ_S  0
/** DSI_HOST_PHY_RSTZ : R/W; bitpos: [1]; default: 0;
 *  NA
 */
#define DSI_HOST_PHY_RSTZ    (BIT(1))
#define DSI_HOST_PHY_RSTZ_M  (DSI_HOST_PHY_RSTZ_V << DSI_HOST_PHY_RSTZ_S)
#define DSI_HOST_PHY_RSTZ_V  0x00000001U
#define DSI_HOST_PHY_RSTZ_S  1
/** DSI_HOST_PHY_ENABLECLK : R/W; bitpos: [2]; default: 0;
 *  NA
 */
#define DSI_HOST_PHY_ENABLECLK    (BIT(2))
#define DSI_HOST_PHY_ENABLECLK_M  (DSI_HOST_PHY_ENABLECLK_V << DSI_HOST_PHY_ENABLECLK_S)
#define DSI_HOST_PHY_ENABLECLK_V  0x00000001U
#define DSI_HOST_PHY_ENABLECLK_S  2
/** DSI_HOST_PHY_FORCEPLL : R/W; bitpos: [3]; default: 0;
 *  NA
 */
#define DSI_HOST_PHY_FORCEPLL    (BIT(3))
#define DSI_HOST_PHY_FORCEPLL_M  (DSI_HOST_PHY_FORCEPLL_V << DSI_HOST_PHY_FORCEPLL_S)
#define DSI_HOST_PHY_FORCEPLL_V  0x00000001U
#define DSI_HOST_PHY_FORCEPLL_S  3

/** DSI_HOST_PHY_IF_CFG_REG register
 *  NA
 */
#define DSI_HOST_PHY_IF_CFG_REG (DR_REG_DSI_HOST_BASE + 0xa4)
/** DSI_HOST_N_LANES : R/W; bitpos: [1:0]; default: 1;
 *  NA
 */
#define DSI_HOST_N_LANES    0x00000003U
#define DSI_HOST_N_LANES_M  (DSI_HOST_N_LANES_V << DSI_HOST_N_LANES_S)
#define DSI_HOST_N_LANES_V  0x00000003U
#define DSI_HOST_N_LANES_S  0
/** DSI_HOST_PHY_STOP_WAIT_TIME : R/W; bitpos: [15:8]; default: 0;
 *  NA
 */
#define DSI_HOST_PHY_STOP_WAIT_TIME    0x000000FFU
#define DSI_HOST_PHY_STOP_WAIT_TIME_M  (DSI_HOST_PHY_STOP_WAIT_TIME_V << DSI_HOST_PHY_STOP_WAIT_TIME_S)
#define DSI_HOST_PHY_STOP_WAIT_TIME_V  0x000000FFU
#define DSI_HOST_PHY_STOP_WAIT_TIME_S  8

/** DSI_HOST_PHY_ULPS_CTRL_REG register
 *  NA
 */
#define DSI_HOST_PHY_ULPS_CTRL_REG (DR_REG_DSI_HOST_BASE + 0xa8)
/** DSI_HOST_PHY_TXREQULPSCLK : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define DSI_HOST_PHY_TXREQULPSCLK    (BIT(0))
#define DSI_HOST_PHY_TXREQULPSCLK_M  (DSI_HOST_PHY_TXREQULPSCLK_V << DSI_HOST_PHY_TXREQULPSCLK_S)
#define DSI_HOST_PHY_TXREQULPSCLK_V  0x00000001U
#define DSI_HOST_PHY_TXREQULPSCLK_S  0
/** DSI_HOST_PHY_TXEXITULPSCLK : R/W; bitpos: [1]; default: 0;
 *  NA
 */
#define DSI_HOST_PHY_TXEXITULPSCLK    (BIT(1))
#define DSI_HOST_PHY_TXEXITULPSCLK_M  (DSI_HOST_PHY_TXEXITULPSCLK_V << DSI_HOST_PHY_TXEXITULPSCLK_S)
#define DSI_HOST_PHY_TXEXITULPSCLK_V  0x00000001U
#define DSI_HOST_PHY_TXEXITULPSCLK_S  1
/** DSI_HOST_PHY_TXREQULPSLAN : R/W; bitpos: [2]; default: 0;
 *  NA
 */
#define DSI_HOST_PHY_TXREQULPSLAN    (BIT(2))
#define DSI_HOST_PHY_TXREQULPSLAN_M  (DSI_HOST_PHY_TXREQULPSLAN_V << DSI_HOST_PHY_TXREQULPSLAN_S)
#define DSI_HOST_PHY_TXREQULPSLAN_V  0x00000001U
#define DSI_HOST_PHY_TXREQULPSLAN_S  2
/** DSI_HOST_PHY_TXEXITULPSLAN : R/W; bitpos: [3]; default: 0;
 *  NA
 */
#define DSI_HOST_PHY_TXEXITULPSLAN    (BIT(3))
#define DSI_HOST_PHY_TXEXITULPSLAN_M  (DSI_HOST_PHY_TXEXITULPSLAN_V << DSI_HOST_PHY_TXEXITULPSLAN_S)
#define DSI_HOST_PHY_TXEXITULPSLAN_V  0x00000001U
#define DSI_HOST_PHY_TXEXITULPSLAN_S  3

/** DSI_HOST_PHY_TX_TRIGGERS_REG register
 *  NA
 */
#define DSI_HOST_PHY_TX_TRIGGERS_REG (DR_REG_DSI_HOST_BASE + 0xac)
/** DSI_HOST_PHY_TX_TRIGGERS : R/W; bitpos: [3:0]; default: 0;
 *  NA
 */
#define DSI_HOST_PHY_TX_TRIGGERS    0x0000000FU
#define DSI_HOST_PHY_TX_TRIGGERS_M  (DSI_HOST_PHY_TX_TRIGGERS_V << DSI_HOST_PHY_TX_TRIGGERS_S)
#define DSI_HOST_PHY_TX_TRIGGERS_V  0x0000000FU
#define DSI_HOST_PHY_TX_TRIGGERS_S  0

/** DSI_HOST_PHY_STATUS_REG register
 *  NA
 */
#define DSI_HOST_PHY_STATUS_REG (DR_REG_DSI_HOST_BASE + 0xb0)
/** DSI_HOST_PHY_LOCK : RO; bitpos: [0]; default: 0;
 *  NA
 */
#define DSI_HOST_PHY_LOCK    (BIT(0))
#define DSI_HOST_PHY_LOCK_M  (DSI_HOST_PHY_LOCK_V << DSI_HOST_PHY_LOCK_S)
#define DSI_HOST_PHY_LOCK_V  0x00000001U
#define DSI_HOST_PHY_LOCK_S  0
/** DSI_HOST_PHY_DIRECTION : RO; bitpos: [1]; default: 0;
 *  NA
 */
#define DSI_HOST_PHY_DIRECTION    (BIT(1))
#define DSI_HOST_PHY_DIRECTION_M  (DSI_HOST_PHY_DIRECTION_V << DSI_HOST_PHY_DIRECTION_S)
#define DSI_HOST_PHY_DIRECTION_V  0x00000001U
#define DSI_HOST_PHY_DIRECTION_S  1
/** DSI_HOST_PHY_STOPSTATECLKLANE : RO; bitpos: [2]; default: 0;
 *  NA
 */
#define DSI_HOST_PHY_STOPSTATECLKLANE    (BIT(2))
#define DSI_HOST_PHY_STOPSTATECLKLANE_M  (DSI_HOST_PHY_STOPSTATECLKLANE_V << DSI_HOST_PHY_STOPSTATECLKLANE_S)
#define DSI_HOST_PHY_STOPSTATECLKLANE_V  0x00000001U
#define DSI_HOST_PHY_STOPSTATECLKLANE_S  2
/** DSI_HOST_PHY_ULPSACTIVENOTCLK : RO; bitpos: [3]; default: 0;
 *  NA
 */
#define DSI_HOST_PHY_ULPSACTIVENOTCLK    (BIT(3))
#define DSI_HOST_PHY_ULPSACTIVENOTCLK_M  (DSI_HOST_PHY_ULPSACTIVENOTCLK_V << DSI_HOST_PHY_ULPSACTIVENOTCLK_S)
#define DSI_HOST_PHY_ULPSACTIVENOTCLK_V  0x00000001U
#define DSI_HOST_PHY_ULPSACTIVENOTCLK_S  3
/** DSI_HOST_PHY_STOPSTATE0LANE : RO; bitpos: [4]; default: 0;
 *  NA
 */
#define DSI_HOST_PHY_STOPSTATE0LANE    (BIT(4))
#define DSI_HOST_PHY_STOPSTATE0LANE_M  (DSI_HOST_PHY_STOPSTATE0LANE_V << DSI_HOST_PHY_STOPSTATE0LANE_S)
#define DSI_HOST_PHY_STOPSTATE0LANE_V  0x00000001U
#define DSI_HOST_PHY_STOPSTATE0LANE_S  4
/** DSI_HOST_PHY_ULPSACTIVENOT0LANE : RO; bitpos: [5]; default: 0;
 *  NA
 */
#define DSI_HOST_PHY_ULPSACTIVENOT0LANE    (BIT(5))
#define DSI_HOST_PHY_ULPSACTIVENOT0LANE_M  (DSI_HOST_PHY_ULPSACTIVENOT0LANE_V << DSI_HOST_PHY_ULPSACTIVENOT0LANE_S)
#define DSI_HOST_PHY_ULPSACTIVENOT0LANE_V  0x00000001U
#define DSI_HOST_PHY_ULPSACTIVENOT0LANE_S  5
/** DSI_HOST_PHY_RXULPSESC0LANE : RO; bitpos: [6]; default: 1;
 *  NA
 */
#define DSI_HOST_PHY_RXULPSESC0LANE    (BIT(6))
#define DSI_HOST_PHY_RXULPSESC0LANE_M  (DSI_HOST_PHY_RXULPSESC0LANE_V << DSI_HOST_PHY_RXULPSESC0LANE_S)
#define DSI_HOST_PHY_RXULPSESC0LANE_V  0x00000001U
#define DSI_HOST_PHY_RXULPSESC0LANE_S  6
/** DSI_HOST_PHY_STOPSTATE1LANE : RO; bitpos: [7]; default: 0;
 *  NA
 */
#define DSI_HOST_PHY_STOPSTATE1LANE    (BIT(7))
#define DSI_HOST_PHY_STOPSTATE1LANE_M  (DSI_HOST_PHY_STOPSTATE1LANE_V << DSI_HOST_PHY_STOPSTATE1LANE_S)
#define DSI_HOST_PHY_STOPSTATE1LANE_V  0x00000001U
#define DSI_HOST_PHY_STOPSTATE1LANE_S  7
/** DSI_HOST_PHY_ULPSACTIVENOT1LANE : RO; bitpos: [8]; default: 1;
 *  NA
 */
#define DSI_HOST_PHY_ULPSACTIVENOT1LANE    (BIT(8))
#define DSI_HOST_PHY_ULPSACTIVENOT1LANE_M  (DSI_HOST_PHY_ULPSACTIVENOT1LANE_V << DSI_HOST_PHY_ULPSACTIVENOT1LANE_S)
#define DSI_HOST_PHY_ULPSACTIVENOT1LANE_V  0x00000001U
#define DSI_HOST_PHY_ULPSACTIVENOT1LANE_S  8

