espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/mipi_dsi_host_reg.h
/** DSI_HOST_PHY_TST_CTRL0_REG register
 *  NA
 */
#define DSI_HOST_PHY_TST_CTRL0_REG (DR_REG_DSI_HOST_BASE + 0xb4)
/** DSI_HOST_PHY_TESTCLR : R/W; bitpos: [0]; default: 1;
 *  NA
 */
#define DSI_HOST_PHY_TESTCLR    (BIT(0))
#define DSI_HOST_PHY_TESTCLR_M  (DSI_HOST_PHY_TESTCLR_V << DSI_HOST_PHY_TESTCLR_S)
#define DSI_HOST_PHY_TESTCLR_V  0x00000001U
#define DSI_HOST_PHY_TESTCLR_S  0
/** DSI_HOST_PHY_TESTCLK : R/W; bitpos: [1]; default: 0;
 *  NA
 */
#define DSI_HOST_PHY_TESTCLK    (BIT(1))
#define DSI_HOST_PHY_TESTCLK_M  (DSI_HOST_PHY_TESTCLK_V << DSI_HOST_PHY_TESTCLK_S)
#define DSI_HOST_PHY_TESTCLK_V  0x00000001U
#define DSI_HOST_PHY_TESTCLK_S  1

/** DSI_HOST_PHY_TST_CTRL1_REG register
 *  NA
 */
#define DSI_HOST_PHY_TST_CTRL1_REG (DR_REG_DSI_HOST_BASE + 0xb8)
/** DSI_HOST_PHY_TESTDIN : R/W; bitpos: [7:0]; default: 0;
 *  NA
 */
#define DSI_HOST_PHY_TESTDIN    0x000000FFU
#define DSI_HOST_PHY_TESTDIN_M  (DSI_HOST_PHY_TESTDIN_V << DSI_HOST_PHY_TESTDIN_S)
#define DSI_HOST_PHY_TESTDIN_V  0x000000FFU
#define DSI_HOST_PHY_TESTDIN_S  0
/** DSI_HOST_PHT_TESTDOUT : RO; bitpos: [15:8]; default: 0;
 *  NA
 */
#define DSI_HOST_PHT_TESTDOUT    0x000000FFU
#define DSI_HOST_PHT_TESTDOUT_M  (DSI_HOST_PHT_TESTDOUT_V << DSI_HOST_PHT_TESTDOUT_S)
#define DSI_HOST_PHT_TESTDOUT_V  0x000000FFU
#define DSI_HOST_PHT_TESTDOUT_S  8
/** DSI_HOST_PHY_TESTEN : R/W; bitpos: [16]; default: 0;
 *  NA
 */
#define DSI_HOST_PHY_TESTEN    (BIT(16))
#define DSI_HOST_PHY_TESTEN_M  (DSI_HOST_PHY_TESTEN_V << DSI_HOST_PHY_TESTEN_S)
#define DSI_HOST_PHY_TESTEN_V  0x00000001U
#define DSI_HOST_PHY_TESTEN_S  16

/** DSI_HOST_INT_ST0_REG register
 *  NA
 */
#define DSI_HOST_INT_ST0_REG (DR_REG_DSI_HOST_BASE + 0xbc)
/** DSI_HOST_ACK_WITH_ERR_0 : RO; bitpos: [0]; default: 0;
 *  NA
 */
#define DSI_HOST_ACK_WITH_ERR_0    (BIT(0))
#define DSI_HOST_ACK_WITH_ERR_0_M  (DSI_HOST_ACK_WITH_ERR_0_V << DSI_HOST_ACK_WITH_ERR_0_S)
#define DSI_HOST_ACK_WITH_ERR_0_V  0x00000001U
#define DSI_HOST_ACK_WITH_ERR_0_S  0
/** DSI_HOST_ACK_WITH_ERR_1 : RO; bitpos: [1]; default: 0;
 *  NA
 */
#define DSI_HOST_ACK_WITH_ERR_1    (BIT(1))
#define DSI_HOST_ACK_WITH_ERR_1_M  (DSI_HOST_ACK_WITH_ERR_1_V << DSI_HOST_ACK_WITH_ERR_1_S)
#define DSI_HOST_ACK_WITH_ERR_1_V  0x00000001U
#define DSI_HOST_ACK_WITH_ERR_1_S  1
/** DSI_HOST_ACK_WITH_ERR_2 : RO; bitpos: [2]; default: 0;
 *  NA
 */
#define DSI_HOST_ACK_WITH_ERR_2    (BIT(2))
#define DSI_HOST_ACK_WITH_ERR_2_M  (DSI_HOST_ACK_WITH_ERR_2_V << DSI_HOST_ACK_WITH_ERR_2_S)
#define DSI_HOST_ACK_WITH_ERR_2_V  0x00000001U
#define DSI_HOST_ACK_WITH_ERR_2_S  2
/** DSI_HOST_ACK_WITH_ERR_3 : RO; bitpos: [3]; default: 0;
 *  NA
 */
#define DSI_HOST_ACK_WITH_ERR_3    (BIT(3))
#define DSI_HOST_ACK_WITH_ERR_3_M  (DSI_HOST_ACK_WITH_ERR_3_V << DSI_HOST_ACK_WITH_ERR_3_S)
#define DSI_HOST_ACK_WITH_ERR_3_V  0x00000001U
#define DSI_HOST_ACK_WITH_ERR_3_S  3
/** DSI_HOST_ACK_WITH_ERR_4 : RO; bitpos: [4]; default: 0;
 *  NA
 */
#define DSI_HOST_ACK_WITH_ERR_4    (BIT(4))
#define DSI_HOST_ACK_WITH_ERR_4_M  (DSI_HOST_ACK_WITH_ERR_4_V << DSI_HOST_ACK_WITH_ERR_4_S)
#define DSI_HOST_ACK_WITH_ERR_4_V  0x00000001U
#define DSI_HOST_ACK_WITH_ERR_4_S  4
/** DSI_HOST_ACK_WITH_ERR_5 : RO; bitpos: [5]; default: 0;
 *  NA
 */
#define DSI_HOST_ACK_WITH_ERR_5    (BIT(5))
#define DSI_HOST_ACK_WITH_ERR_5_M  (DSI_HOST_ACK_WITH_ERR_5_V << DSI_HOST_ACK_WITH_ERR_5_S)
#define DSI_HOST_ACK_WITH_ERR_5_V  0x00000001U
#define DSI_HOST_ACK_WITH_ERR_5_S  5
/** DSI_HOST_ACK_WITH_ERR_6 : RO; bitpos: [6]; default: 0;
 *  NA
 */
#define DSI_HOST_ACK_WITH_ERR_6    (BIT(6))
#define DSI_HOST_ACK_WITH_ERR_6_M  (DSI_HOST_ACK_WITH_ERR_6_V << DSI_HOST_ACK_WITH_ERR_6_S)
#define DSI_HOST_ACK_WITH_ERR_6_V  0x00000001U
#define DSI_HOST_ACK_WITH_ERR_6_S  6
/** DSI_HOST_ACK_WITH_ERR_7 : RO; bitpos: [7]; default: 0;
 *  NA
 */
#define DSI_HOST_ACK_WITH_ERR_7    (BIT(7))
#define DSI_HOST_ACK_WITH_ERR_7_M  (DSI_HOST_ACK_WITH_ERR_7_V << DSI_HOST_ACK_WITH_ERR_7_S)
#define DSI_HOST_ACK_WITH_ERR_7_V  0x00000001U
#define DSI_HOST_ACK_WITH_ERR_7_S  7
/** DSI_HOST_ACK_WITH_ERR_8 : RO; bitpos: [8]; default: 0;
 *  NA
 */
#define DSI_HOST_ACK_WITH_ERR_8    (BIT(8))
#define DSI_HOST_ACK_WITH_ERR_8_M  (DSI_HOST_ACK_WITH_ERR_8_V << DSI_HOST_ACK_WITH_ERR_8_S)
#define DSI_HOST_ACK_WITH_ERR_8_V  0x00000001U
#define DSI_HOST_ACK_WITH_ERR_8_S  8
/** DSI_HOST_ACK_WITH_ERR_9 : RO; bitpos: [9]; default: 0;
 *  NA
 */
#define DSI_HOST_ACK_WITH_ERR_9    (BIT(9))
#define DSI_HOST_ACK_WITH_ERR_9_M  (DSI_HOST_ACK_WITH_ERR_9_V << DSI_HOST_ACK_WITH_ERR_9_S)
#define DSI_HOST_ACK_WITH_ERR_9_V  0x00000001U
#define DSI_HOST_ACK_WITH_ERR_9_S  9
/** DSI_HOST_ACK_WITH_ERR_10 : RO; bitpos: [10]; default: 0;
 *  NA
 */
#define DSI_HOST_ACK_WITH_ERR_10    (BIT(10))
#define DSI_HOST_ACK_WITH_ERR_10_M  (DSI_HOST_ACK_WITH_ERR_10_V << DSI_HOST_ACK_WITH_ERR_10_S)
#define DSI_HOST_ACK_WITH_ERR_10_V  0x00000001U
#define DSI_HOST_ACK_WITH_ERR_10_S  10
/** DSI_HOST_ACK_WITH_ERR_11 : RO; bitpos: [11]; default: 0;
 *  NA
 */
#define DSI_HOST_ACK_WITH_ERR_11    (BIT(11))
#define DSI_HOST_ACK_WITH_ERR_11_M  (DSI_HOST_ACK_WITH_ERR_11_V << DSI_HOST_ACK_WITH_ERR_11_S)
#define DSI_HOST_ACK_WITH_ERR_11_V  0x00000001U
#define DSI_HOST_ACK_WITH_ERR_11_S  11
/** DSI_HOST_ACK_WITH_ERR_12 : RO; bitpos: [12]; default: 0;
 *  NA
 */
#define DSI_HOST_ACK_WITH_ERR_12    (BIT(12))
#define DSI_HOST_ACK_WITH_ERR_12_M  (DSI_HOST_ACK_WITH_ERR_12_V << DSI_HOST_ACK_WITH_ERR_12_S)
#define DSI_HOST_ACK_WITH_ERR_12_V  0x00000001U
#define DSI_HOST_ACK_WITH_ERR_12_S  12
/** DSI_HOST_ACK_WITH_ERR_13 : RO; bitpos: [13]; default: 0;
 *  NA
 */
#define DSI_HOST_ACK_WITH_ERR_13    (BIT(13))
#define DSI_HOST_ACK_WITH_ERR_13_M  (DSI_HOST_ACK_WITH_ERR_13_V << DSI_HOST_ACK_WITH_ERR_13_S)
#define DSI_HOST_ACK_WITH_ERR_13_V  0x00000001U
#define DSI_HOST_ACK_WITH_ERR_13_S  13
/** DSI_HOST_ACK_WITH_ERR_14 : RO; bitpos: [14]; default: 0;
 *  NA
 */
#define DSI_HOST_ACK_WITH_ERR_14    (BIT(14))
#define DSI_HOST_ACK_WITH_ERR_14_M  (DSI_HOST_ACK_WITH_ERR_14_V << DSI_HOST_ACK_WITH_ERR_14_S)
#define DSI_HOST_ACK_WITH_ERR_14_V  0x00000001U
#define DSI_HOST_ACK_WITH_ERR_14_S  14
/** DSI_HOST_ACK_WITH_ERR_15 : RO; bitpos: [15]; default: 0;
 *  NA
 */
#define DSI_HOST_ACK_WITH_ERR_15    (BIT(15))
#define DSI_HOST_ACK_WITH_ERR_15_M  (DSI_HOST_ACK_WITH_ERR_15_V << DSI_HOST_ACK_WITH_ERR_15_S)
#define DSI_HOST_ACK_WITH_ERR_15_V  0x00000001U
#define DSI_HOST_ACK_WITH_ERR_15_S  15
/** DSI_HOST_DPHY_ERRORS_0 : RO; bitpos: [16]; default: 0;
 *  NA
 */
#define DSI_HOST_DPHY_ERRORS_0    (BIT(16))
#define DSI_HOST_DPHY_ERRORS_0_M  (DSI_HOST_DPHY_ERRORS_0_V << DSI_HOST_DPHY_ERRORS_0_S)
#define DSI_HOST_DPHY_ERRORS_0_V  0x00000001U
#define DSI_HOST_DPHY_ERRORS_0_S  16
/** DSI_HOST_DPHY_ERRORS_1 : RO; bitpos: [17]; default: 0;
 *  NA
 */
#define DSI_HOST_DPHY_ERRORS_1    (BIT(17))
#define DSI_HOST_DPHY_ERRORS_1_M  (DSI_HOST_DPHY_ERRORS_1_V << DSI_HOST_DPHY_ERRORS_1_S)
#define DSI_HOST_DPHY_ERRORS_1_V  0x00000001U
#define DSI_HOST_DPHY_ERRORS_1_S  17
/** DSI_HOST_DPHY_ERRORS_2 : RO; bitpos: [18]; default: 0;
 *  NA
 */
#define DSI_HOST_DPHY_ERRORS_2    (BIT(18))
#define DSI_HOST_DPHY_ERRORS_2_M  (DSI_HOST_DPHY_ERRORS_2_V << DSI_HOST_DPHY_ERRORS_2_S)
#define DSI_HOST_DPHY_ERRORS_2_V  0x00000001U
#define DSI_HOST_DPHY_ERRORS_2_S  18
/** DSI_HOST_DPHY_ERRORS_3 : RO; bitpos: [19]; default: 0;
 *  NA
 */
#define DSI_HOST_DPHY_ERRORS_3    (BIT(19))
#define DSI_HOST_DPHY_ERRORS_3_M  (DSI_HOST_DPHY_ERRORS_3_V << DSI_HOST_DPHY_ERRORS_3_S)
#define DSI_HOST_DPHY_ERRORS_3_V  0x00000001U
#define DSI_HOST_DPHY_ERRORS_3_S  19
/** DSI_HOST_DPHY_ERRORS_4 : RO; bitpos: [20]; default: 0;
 *  NA
 */
#define DSI_HOST_DPHY_ERRORS_4    (BIT(20))
#define DSI_HOST_DPHY_ERRORS_4_M  (DSI_HOST_DPHY_ERRORS_4_V << DSI_HOST_DPHY_ERRORS_4_S)
#define DSI_HOST_DPHY_ERRORS_4_V  0x00000001U
#define DSI_HOST_DPHY_ERRORS_4_S  20

/** DSI_HOST_INT_ST1_REG register
 *  NA
 */
#define DSI_HOST_INT_ST1_REG (DR_REG_DSI_HOST_BASE + 0xc0)
/** DSI_HOST_TO_HS_TX : RO; bitpos: [0]; default: 0;
 *  NA
 */
#define DSI_HOST_TO_HS_TX    (BIT(0))
#define DSI_HOST_TO_HS_TX_M  (DSI_HOST_TO_HS_TX_V << DSI_HOST_TO_HS_TX_S)
#define DSI_HOST_TO_HS_TX_V  0x00000001U
#define DSI_HOST_TO_HS_TX_S  0
/** DSI_HOST_TO_LP_RX : RO; bitpos: [1]; default: 0;
 *  NA
 */
#define DSI_HOST_TO_LP_RX    (BIT(1))
#define DSI_HOST_TO_LP_RX_M  (DSI_HOST_TO_LP_RX_V << DSI_HOST_TO_LP_RX_S)
#define DSI_HOST_TO_LP_RX_V  0x00000001U
#define DSI_HOST_TO_LP_RX_S  1
/** DSI_HOST_ECC_SINGLE_ERR : RO; bitpos: [2]; default: 0;
 *  NA
 */
#define DSI_HOST_ECC_SINGLE_ERR    (BIT(2))
#define DSI_HOST_ECC_SINGLE_ERR_M  (DSI_HOST_ECC_SINGLE_ERR_V << DSI_HOST_ECC_SINGLE_ERR_S)
#define DSI_HOST_ECC_SINGLE_ERR_V  0x00000001U
#define DSI_HOST_ECC_SINGLE_ERR_S  2
/** DSI_HOST_ECC_MILTI_ERR : RO; bitpos: [3]; default: 0;
 *  NA
 */
#define DSI_HOST_ECC_MILTI_ERR    (BIT(3))
#define DSI_HOST_ECC_MILTI_ERR_M  (DSI_HOST_ECC_MILTI_ERR_V << DSI_HOST_ECC_MILTI_ERR_S)
#define DSI_HOST_ECC_MILTI_ERR_V  0x00000001U
#define DSI_HOST_ECC_MILTI_ERR_S  3
/** DSI_HOST_CRC_ERR : RO; bitpos: [4]; default: 0;
 *  NA
 */
#define DSI_HOST_CRC_ERR    (BIT(4))
#define DSI_HOST_CRC_ERR_M  (DSI_HOST_CRC_ERR_V << DSI_HOST_CRC_ERR_S)
#define DSI_HOST_CRC_ERR_V  0x00000001U
#define DSI_HOST_CRC_ERR_S  4
/** DSI_HOST_PKT_SIZE_ERR : RO; bitpos: [5]; default: 0;
 *  NA
 */
#define DSI_HOST_PKT_SIZE_ERR    (BIT(5))
#define DSI_HOST_PKT_SIZE_ERR_M  (DSI_HOST_PKT_SIZE_ERR_V << DSI_HOST_PKT_SIZE_ERR_S)
#define DSI_HOST_PKT_SIZE_ERR_V  0x00000001U
#define DSI_HOST_PKT_SIZE_ERR_S  5
/** DSI_HOST_EOPT_ERR : RO; bitpos: [6]; default: 0;
 *  NA
 */
#define DSI_HOST_EOPT_ERR    (BIT(6))
#define DSI_HOST_EOPT_ERR_M  (DSI_HOST_EOPT_ERR_V << DSI_HOST_EOPT_ERR_S)
#define DSI_HOST_EOPT_ERR_V  0x00000001U
#define DSI_HOST_EOPT_ERR_S  6
/** DSI_HOST_DPI_PLD_WR_ERR : RO; bitpos: [7]; default: 0;
 *  NA
 */
#define DSI_HOST_DPI_PLD_WR_ERR    (BIT(7))
#define DSI_HOST_DPI_PLD_WR_ERR_M  (DSI_HOST_DPI_PLD_WR_ERR_V << DSI_HOST_DPI_PLD_WR_ERR_S)
#define DSI_HOST_DPI_PLD_WR_ERR_V  0x00000001U
#define DSI_HOST_DPI_PLD_WR_ERR_S  7
/** DSI_HOST_GEN_CMD_WR_ERR : RO; bitpos: [8]; default: 0;
 *  NA
 */
#define DSI_HOST_GEN_CMD_WR_ERR    (BIT(8))
#define DSI_HOST_GEN_CMD_WR_ERR_M  (DSI_HOST_GEN_CMD_WR_ERR_V << DSI_HOST_GEN_CMD_WR_ERR_S)
#define DSI_HOST_GEN_CMD_WR_ERR_V  0x00000001U
#define DSI_HOST_GEN_CMD_WR_ERR_S  8
/** DSI_HOST_GEN_PLD_WR_ERR : RO; bitpos: [9]; default: 0;
 *  NA
 */
#define DSI_HOST_GEN_PLD_WR_ERR    (BIT(9))
#define DSI_HOST_GEN_PLD_WR_ERR_M  (DSI_HOST_GEN_PLD_WR_ERR_V << DSI_HOST_GEN_PLD_WR_ERR_S)
#define DSI_HOST_GEN_PLD_WR_ERR_V  0x00000001U
#define DSI_HOST_GEN_PLD_WR_ERR_S  9
/** DSI_HOST_GEN_PLD_SEND_ERR : RO; bitpos: [10]; default: 0;
 *  NA
 */
#define DSI_HOST_GEN_PLD_SEND_ERR    (BIT(10))
#define DSI_HOST_GEN_PLD_SEND_ERR_M  (DSI_HOST_GEN_PLD_SEND_ERR_V << DSI_HOST_GEN_PLD_SEND_ERR_S)
#define DSI_HOST_GEN_PLD_SEND_ERR_V  0x00000001U
#define DSI_HOST_GEN_PLD_SEND_ERR_S  10
/** DSI_HOST_GEN_PLD_RD_ERR : RO; bitpos: [11]; default: 0;
 *  NA
 */
#define DSI_HOST_GEN_PLD_RD_ERR    (BIT(11))
#define DSI_HOST_GEN_PLD_RD_ERR_M  (DSI_HOST_GEN_PLD_RD_ERR_V << DSI_HOST_GEN_PLD_RD_ERR_S)
#define DSI_HOST_GEN_PLD_RD_ERR_V  0x00000001U
#define DSI_HOST_GEN_PLD_RD_ERR_S  11
/** DSI_HOST_GEN_PLD_RECEV_ERR : RO; bitpos: [12]; default: 0;
 *  NA
 */
#define DSI_HOST_GEN_PLD_RECEV_ERR    (BIT(12))
#define DSI_HOST_GEN_PLD_RECEV_ERR_M  (DSI_HOST_GEN_PLD_RECEV_ERR_V << DSI_HOST_GEN_PLD_RECEV_ERR_S)
#define DSI_HOST_GEN_PLD_RECEV_ERR_V  0x00000001U
#define DSI_HOST_GEN_PLD_RECEV_ERR_S  12
/** DSI_HOST_DPI_BUFF_PLD_UNDER : RO; bitpos: [19]; default: 0;
 *  NA
 */
#define DSI_HOST_DPI_BUFF_PLD_UNDER    (BIT(19))
#define DSI_HOST_DPI_BUFF_PLD_UNDER_M  (DSI_HOST_DPI_BUFF_PLD_UNDER_V << DSI_HOST_DPI_BUFF_PLD_UNDER_S)
#define DSI_HOST_DPI_BUFF_PLD_UNDER_V  0x00000001U
#define DSI_HOST_DPI_BUFF_PLD_UNDER_S  19

/** DSI_HOST_INT_MSK0_REG register
 *  NA
 */
#define DSI_HOST_INT_MSK0_REG (DR_REG_DSI_HOST_BASE + 0xc4)
/** DSI_HOST_MASK_ACK_WITH_ERR_0 : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_ACK_WITH_ERR_0    (BIT(0))
#define DSI_HOST_MASK_ACK_WITH_ERR_0_M  (DSI_HOST_MASK_ACK_WITH_ERR_0_V << DSI_HOST_MASK_ACK_WITH_ERR_0_S)
#define DSI_HOST_MASK_ACK_WITH_ERR_0_V  0x00000001U
#define DSI_HOST_MASK_ACK_WITH_ERR_0_S  0
/** DSI_HOST_MASK_ACK_WITH_ERR_1 : R/W; bitpos: [1]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_ACK_WITH_ERR_1    (BIT(1))
#define DSI_HOST_MASK_ACK_WITH_ERR_1_M  (DSI_HOST_MASK_ACK_WITH_ERR_1_V << DSI_HOST_MASK_ACK_WITH_ERR_1_S)
#define DSI_HOST_MASK_ACK_WITH_ERR_1_V  0x00000001U
#define DSI_HOST_MASK_ACK_WITH_ERR_1_S  1
/** DSI_HOST_MASK_ACK_WITH_ERR_2 : R/W; bitpos: [2]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_ACK_WITH_ERR_2    (BIT(2))
#define DSI_HOST_MASK_ACK_WITH_ERR_2_M  (DSI_HOST_MASK_ACK_WITH_ERR_2_V << DSI_HOST_MASK_ACK_WITH_ERR_2_S)
#define DSI_HOST_MASK_ACK_WITH_ERR_2_V  0x00000001U
#define DSI_HOST_MASK_ACK_WITH_ERR_2_S  2
/** DSI_HOST_MASK_ACK_WITH_ERR_3 : R/W; bitpos: [3]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_ACK_WITH_ERR_3    (BIT(3))
#define DSI_HOST_MASK_ACK_WITH_ERR_3_M  (DSI_HOST_MASK_ACK_WITH_ERR_3_V << DSI_HOST_MASK_ACK_WITH_ERR_3_S)
#define DSI_HOST_MASK_ACK_WITH_ERR_3_V  0x00000001U
#define DSI_HOST_MASK_ACK_WITH_ERR_3_S  3
/** DSI_HOST_MASK_ACK_WITH_ERR_4 : R/W; bitpos: [4]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_ACK_WITH_ERR_4    (BIT(4))
#define DSI_HOST_MASK_ACK_WITH_ERR_4_M  (DSI_HOST_MASK_ACK_WITH_ERR_4_V << DSI_HOST_MASK_ACK_WITH_ERR_4_S)
#define DSI_HOST_MASK_ACK_WITH_ERR_4_V  0x00000001U
#define DSI_HOST_MASK_ACK_WITH_ERR_4_S  4
/** DSI_HOST_MASK_ACK_WITH_ERR_5 : R/W; bitpos: [5]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_ACK_WITH_ERR_5    (BIT(5))
#define DSI_HOST_MASK_ACK_WITH_ERR_5_M  (DSI_HOST_MASK_ACK_WITH_ERR_5_V << DSI_HOST_MASK_ACK_WITH_ERR_5_S)
#define DSI_HOST_MASK_ACK_WITH_ERR_5_V  0x00000001U
#define DSI_HOST_MASK_ACK_WITH_ERR_5_S  5
/** DSI_HOST_MASK_ACK_WITH_ERR_6 : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_ACK_WITH_ERR_6    (BIT(6))
#define DSI_HOST_MASK_ACK_WITH_ERR_6_M  (DSI_HOST_MASK_ACK_WITH_ERR_6_V << DSI_HOST_MASK_ACK_WITH_ERR_6_S)
#define DSI_HOST_MASK_ACK_WITH_ERR_6_V  0x00000001U
#define DSI_HOST_MASK_ACK_WITH_ERR_6_S  6
/** DSI_HOST_MASK_ACK_WITH_ERR_7 : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_ACK_WITH_ERR_7    (BIT(7))
#define DSI_HOST_MASK_ACK_WITH_ERR_7_M  (DSI_HOST_MASK_ACK_WITH_ERR_7_V << DSI_HOST_MASK_ACK_WITH_ERR_7_S)
#define DSI_HOST_MASK_ACK_WITH_ERR_7_V  0x00000001U
#define DSI_HOST_MASK_ACK_WITH_ERR_7_S  7
/** DSI_HOST_MASK_ACK_WITH_ERR_8 : R/W; bitpos: [8]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_ACK_WITH_ERR_8    (BIT(8))
#define DSI_HOST_MASK_ACK_WITH_ERR_8_M  (DSI_HOST_MASK_ACK_WITH_ERR_8_V << DSI_HOST_MASK_ACK_WITH_ERR_8_S)
#define DSI_HOST_MASK_ACK_WITH_ERR_8_V  0x00000001U
#define DSI_HOST_MASK_ACK_WITH_ERR_8_S  8
/** DSI_HOST_MASK_ACK_WITH_ERR_9 : R/W; bitpos: [9]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_ACK_WITH_ERR_9    (BIT(9))
#define DSI_HOST_MASK_ACK_WITH_ERR_9_M  (DSI_HOST_MASK_ACK_WITH_ERR_9_V << DSI_HOST_MASK_ACK_WITH_ERR_9_S)
#define DSI_HOST_MASK_ACK_WITH_ERR_9_V  0x00000001U
#define DSI_HOST_MASK_ACK_WITH_ERR_9_S  9
/** DSI_HOST_MASK_ACK_WITH_ERR_10 : R/W; bitpos: [10]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_ACK_WITH_ERR_10    (BIT(10))
#define DSI_HOST_MASK_ACK_WITH_ERR_10_M  (DSI_HOST_MASK_ACK_WITH_ERR_10_V << DSI_HOST_MASK_ACK_WITH_ERR_10_S)
#define DSI_HOST_MASK_ACK_WITH_ERR_10_V  0x00000001U
#define DSI_HOST_MASK_ACK_WITH_ERR_10_S  10
/** DSI_HOST_MASK_ACK_WITH_ERR_11 : R/W; bitpos: [11]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_ACK_WITH_ERR_11    (BIT(11))
#define DSI_HOST_MASK_ACK_WITH_ERR_11_M  (DSI_HOST_MASK_ACK_WITH_ERR_11_V << DSI_HOST_MASK_ACK_WITH_ERR_11_S)
#define DSI_HOST_MASK_ACK_WITH_ERR_11_V  0x00000001U
#define DSI_HOST_MASK_ACK_WITH_ERR_11_S  11
/** DSI_HOST_MASK_ACK_WITH_ERR_12 : R/W; bitpos: [12]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_ACK_WITH_ERR_12    (BIT(12))
#define DSI_HOST_MASK_ACK_WITH_ERR_12_M  (DSI_HOST_MASK_ACK_WITH_ERR_12_V << DSI_HOST_MASK_ACK_WITH_ERR_12_S)
#define DSI_HOST_MASK_ACK_WITH_ERR_12_V  0x00000001U
#define DSI_HOST_MASK_ACK_WITH_ERR_12_S  12
/** DSI_HOST_MASK_ACK_WITH_ERR_13 : R/W; bitpos: [13]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_ACK_WITH_ERR_13    (BIT(13))
#define DSI_HOST_MASK_ACK_WITH_ERR_13_M  (DSI_HOST_MASK_ACK_WITH_ERR_13_V << DSI_HOST_MASK_ACK_WITH_ERR_13_S)
#define DSI_HOST_MASK_ACK_WITH_ERR_13_V  0x00000001U
#define DSI_HOST_MASK_ACK_WITH_ERR_13_S  13
/** DSI_HOST_MASK_ACK_WITH_ERR_14 : R/W; bitpos: [14]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_ACK_WITH_ERR_14    (BIT(14))
#define DSI_HOST_MASK_ACK_WITH_ERR_14_M  (DSI_HOST_MASK_ACK_WITH_ERR_14_V << DSI_HOST_MASK_ACK_WITH_ERR_14_S)
#define DSI_HOST_MASK_ACK_WITH_ERR_14_V  0x00000001U
#define DSI_HOST_MASK_ACK_WITH_ERR_14_S  14
/** DSI_HOST_MASK_ACK_WITH_ERR_15 : R/W; bitpos: [15]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_ACK_WITH_ERR_15    (BIT(15))
#define DSI_HOST_MASK_ACK_WITH_ERR_15_M  (DSI_HOST_MASK_ACK_WITH_ERR_15_V << DSI_HOST_MASK_ACK_WITH_ERR_15_S)
#define DSI_HOST_MASK_ACK_WITH_ERR_15_V  0x00000001U
#define DSI_HOST_MASK_ACK_WITH_ERR_15_S  15
/** DSI_HOST_MASK_DPHY_ERRORS_0 : R/W; bitpos: [16]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_DPHY_ERRORS_0    (BIT(16))
#define DSI_HOST_MASK_DPHY_ERRORS_0_M  (DSI_HOST_MASK_DPHY_ERRORS_0_V << DSI_HOST_MASK_DPHY_ERRORS_0_S)
#define DSI_HOST_MASK_DPHY_ERRORS_0_V  0x00000001U
#define DSI_HOST_MASK_DPHY_ERRORS_0_S  16
/** DSI_HOST_MASK_DPHY_ERRORS_1 : R/W; bitpos: [17]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_DPHY_ERRORS_1    (BIT(17))
#define DSI_HOST_MASK_DPHY_ERRORS_1_M  (DSI_HOST_MASK_DPHY_ERRORS_1_V << DSI_HOST_MASK_DPHY_ERRORS_1_S)
#define DSI_HOST_MASK_DPHY_ERRORS_1_V  0x00000001U
#define DSI_HOST_MASK_DPHY_ERRORS_1_S  17
/** DSI_HOST_MASK_DPHY_ERRORS_2 : R/W; bitpos: [18]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_DPHY_ERRORS_2    (BIT(18))
#define DSI_HOST_MASK_DPHY_ERRORS_2_M  (DSI_HOST_MASK_DPHY_ERRORS_2_V << DSI_HOST_MASK_DPHY_ERRORS_2_S)
#define DSI_HOST_MASK_DPHY_ERRORS_2_V  0x00000001U
#define DSI_HOST_MASK_DPHY_ERRORS_2_S  18
/** DSI_HOST_MASK_DPHY_ERRORS_3 : R/W; bitpos: [19]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_DPHY_ERRORS_3    (BIT(19))
#define DSI_HOST_MASK_DPHY_ERRORS_3_M  (DSI_HOST_MASK_DPHY_ERRORS_3_V << DSI_HOST_MASK_DPHY_ERRORS_3_S)
#define DSI_HOST_MASK_DPHY_ERRORS_3_V  0x00000001U
#define DSI_HOST_MASK_DPHY_ERRORS_3_S  19
/** DSI_HOST_MASK_DPHY_ERRORS_4 : R/W; bitpos: [20]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_DPHY_ERRORS_4    (BIT(20))
#define DSI_HOST_MASK_DPHY_ERRORS_4_M  (DSI_HOST_MASK_DPHY_ERRORS_4_V << DSI_HOST_MASK_DPHY_ERRORS_4_S)
#define DSI_HOST_MASK_DPHY_ERRORS_4_V  0x00000001U
#define DSI_HOST_MASK_DPHY_ERRORS_4_S  20

/** DSI_HOST_INT_MSK1_REG register
 *  NA
 */
#define DSI_HOST_INT_MSK1_REG (DR_REG_DSI_HOST_BASE + 0xc8)
/** DSI_HOST_MASK_TO_HS_TX : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_TO_HS_TX    (BIT(0))
#define DSI_HOST_MASK_TO_HS_TX_M  (DSI_HOST_MASK_TO_HS_TX_V << DSI_HOST_MASK_TO_HS_TX_S)
#define DSI_HOST_MASK_TO_HS_TX_V  0x00000001U
#define DSI_HOST_MASK_TO_HS_TX_S  0
/** DSI_HOST_MASK_TO_LP_RX : R/W; bitpos: [1]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_TO_LP_RX    (BIT(1))
#define DSI_HOST_MASK_TO_LP_RX_M  (DSI_HOST_MASK_TO_LP_RX_V << DSI_HOST_MASK_TO_LP_RX_S)
#define DSI_HOST_MASK_TO_LP_RX_V  0x00000001U
#define DSI_HOST_MASK_TO_LP_RX_S  1
/** DSI_HOST_MASK_ECC_SINGLE_ERR : R/W; bitpos: [2]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_ECC_SINGLE_ERR    (BIT(2))
#define DSI_HOST_MASK_ECC_SINGLE_ERR_M  (DSI_HOST_MASK_ECC_SINGLE_ERR_V << DSI_HOST_MASK_ECC_SINGLE_ERR_S)
#define DSI_HOST_MASK_ECC_SINGLE_ERR_V  0x00000001U
#define DSI_HOST_MASK_ECC_SINGLE_ERR_S  2
/** DSI_HOST_MASK_ECC_MILTI_ERR : R/W; bitpos: [3]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_ECC_MILTI_ERR    (BIT(3))
#define DSI_HOST_MASK_ECC_MILTI_ERR_M  (DSI_HOST_MASK_ECC_MILTI_ERR_V << DSI_HOST_MASK_ECC_MILTI_ERR_S)
#define DSI_HOST_MASK_ECC_MILTI_ERR_V  0x00000001U
#define DSI_HOST_MASK_ECC_MILTI_ERR_S  3
/** DSI_HOST_MASK_CRC_ERR : R/W; bitpos: [4]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_CRC_ERR    (BIT(4))
#define DSI_HOST_MASK_CRC_ERR_M  (DSI_HOST_MASK_CRC_ERR_V << DSI_HOST_MASK_CRC_ERR_S)
#define DSI_HOST_MASK_CRC_ERR_V  0x00000001U
#define DSI_HOST_MASK_CRC_ERR_S  4
/** DSI_HOST_MASK_PKT_SIZE_ERR : R/W; bitpos: [5]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_PKT_SIZE_ERR    (BIT(5))
#define DSI_HOST_MASK_PKT_SIZE_ERR_M  (DSI_HOST_MASK_PKT_SIZE_ERR_V << DSI_HOST_MASK_PKT_SIZE_ERR_S)
#define DSI_HOST_MASK_PKT_SIZE_ERR_V  0x00000001U
#define DSI_HOST_MASK_PKT_SIZE_ERR_S  5
/** DSI_HOST_MASK_EOPT_ERR : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_EOPT_ERR    (BIT(6))
#define DSI_HOST_MASK_EOPT_ERR_M  (DSI_HOST_MASK_EOPT_ERR_V << DSI_HOST_MASK_EOPT_ERR_S)
#define DSI_HOST_MASK_EOPT_ERR_V  0x00000001U
#define DSI_HOST_MASK_EOPT_ERR_S  6
/** DSI_HOST_MASK_DPI_PLD_WR_ERR : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_DPI_PLD_WR_ERR    (BIT(7))
#define DSI_HOST_MASK_DPI_PLD_WR_ERR_M  (DSI_HOST_MASK_DPI_PLD_WR_ERR_V << DSI_HOST_MASK_DPI_PLD_WR_ERR_S)
#define DSI_HOST_MASK_DPI_PLD_WR_ERR_V  0x00000001U
#define DSI_HOST_MASK_DPI_PLD_WR_ERR_S  7
/** DSI_HOST_MASK_GEN_CMD_WR_ERR : R/W; bitpos: [8]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_GEN_CMD_WR_ERR    (BIT(8))
#define DSI_HOST_MASK_GEN_CMD_WR_ERR_M  (DSI_HOST_MASK_GEN_CMD_WR_ERR_V << DSI_HOST_MASK_GEN_CMD_WR_ERR_S)
#define DSI_HOST_MASK_GEN_CMD_WR_ERR_V  0x00000001U
#define DSI_HOST_MASK_GEN_CMD_WR_ERR_S  8
/** DSI_HOST_MASK_GEN_PLD_WR_ERR : R/W; bitpos: [9]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_GEN_PLD_WR_ERR    (BIT(9))
#define DSI_HOST_MASK_GEN_PLD_WR_ERR_M  (DSI_HOST_MASK_GEN_PLD_WR_ERR_V << DSI_HOST_MASK_GEN_PLD_WR_ERR_S)
#define DSI_HOST_MASK_GEN_PLD_WR_ERR_V  0x00000001U
#define DSI_HOST_MASK_GEN_PLD_WR_ERR_S  9
/** DSI_HOST_MASK_GEN_PLD_SEND_ERR : R/W; bitpos: [10]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_GEN_PLD_SEND_ERR    (BIT(10))
#define DSI_HOST_MASK_GEN_PLD_SEND_ERR_M  (DSI_HOST_MASK_GEN_PLD_SEND_ERR_V << DSI_HOST_MASK_GEN_PLD_SEND_ERR_S)
#define DSI_HOST_MASK_GEN_PLD_SEND_ERR_V  0x00000001U
#define DSI_HOST_MASK_GEN_PLD_SEND_ERR_S  10
/** DSI_HOST_MASK_GEN_PLD_RD_ERR : R/W; bitpos: [11]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_GEN_PLD_RD_ERR    (BIT(11))
#define DSI_HOST_MASK_GEN_PLD_RD_ERR_M  (DSI_HOST_MASK_GEN_PLD_RD_ERR_V << DSI_HOST_MASK_GEN_PLD_RD_ERR_S)
#define DSI_HOST_MASK_GEN_PLD_RD_ERR_V  0x00000001U
#define DSI_HOST_MASK_GEN_PLD_RD_ERR_S  11
/** DSI_HOST_MASK_GEN_PLD_RECEV_ERR : R/W; bitpos: [12]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_GEN_PLD_RECEV_ERR    (BIT(12))
#define DSI_HOST_MASK_GEN_PLD_RECEV_ERR_M  (DSI_HOST_MASK_GEN_PLD_RECEV_ERR_V << DSI_HOST_MASK_GEN_PLD_RECEV_ERR_S)
#define DSI_HOST_MASK_GEN_PLD_RECEV_ERR_V  0x00000001U
#define DSI_HOST_MASK_GEN_PLD_RECEV_ERR_S  12
/** DSI_HOST_MASK_DPI_BUFF_PLD_UNDER : R/W; bitpos: [19]; default: 0;
 *  NA
 */
#define DSI_HOST_MASK_DPI_BUFF_PLD_UNDER    (BIT(19))
#define DSI_HOST_MASK_DPI_BUFF_PLD_UNDER_M  (DSI_HOST_MASK_DPI_BUFF_PLD_UNDER_V << DSI_HOST_MASK_DPI_BUFF_PLD_UNDER_S)
#define DSI_HOST_MASK_DPI_BUFF_PLD_UNDER_V  0x00000001U
#define DSI_HOST_MASK_DPI_BUFF_PLD_UNDER_S  19

/** DSI_HOST_PHY_CAL_REG register
 *  NA
 */
#define DSI_HOST_PHY_CAL_REG (DR_REG_DSI_HOST_BASE + 0xcc)
/** DSI_HOST_TXSKEWCALHS : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define DSI_HOST_TXSKEWCALHS    (BIT(0))
#define DSI_HOST_TXSKEWCALHS_M  (DSI_HOST_TXSKEWCALHS_V << DSI_HOST_TXSKEWCALHS_S)
#define DSI_HOST_TXSKEWCALHS_V  0x00000001U
#define DSI_HOST_TXSKEWCALHS_S  0

