espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/mipi_dsi_host_reg.h
/** DSI_HOST_DSC_PARAMETER_REG register
 *  NA
 */
#define DSI_HOST_DSC_PARAMETER_REG (DR_REG_DSI_HOST_BASE + 0xf0)
/** DSI_HOST_COMPRESSION_MODE : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define DSI_HOST_COMPRESSION_MODE    (BIT(0))
#define DSI_HOST_COMPRESSION_MODE_M  (DSI_HOST_COMPRESSION_MODE_V << DSI_HOST_COMPRESSION_MODE_S)
#define DSI_HOST_COMPRESSION_MODE_V  0x00000001U
#define DSI_HOST_COMPRESSION_MODE_S  0
/** DSI_HOST_COMPRESS_ALGO : R/W; bitpos: [9:8]; default: 0;
 *  NA
 */
#define DSI_HOST_COMPRESS_ALGO    0x00000003U
#define DSI_HOST_COMPRESS_ALGO_M  (DSI_HOST_COMPRESS_ALGO_V << DSI_HOST_COMPRESS_ALGO_S)
#define DSI_HOST_COMPRESS_ALGO_V  0x00000003U
#define DSI_HOST_COMPRESS_ALGO_S  8
/** DSI_HOST_PPS_SEL : R/W; bitpos: [17:16]; default: 0;
 *  NA
 */
#define DSI_HOST_PPS_SEL    0x00000003U
#define DSI_HOST_PPS_SEL_M  (DSI_HOST_PPS_SEL_V << DSI_HOST_PPS_SEL_S)
#define DSI_HOST_PPS_SEL_V  0x00000003U
#define DSI_HOST_PPS_SEL_S  16

/** DSI_HOST_PHY_TMR_RD_CFG_REG register
 *  NA
 */
#define DSI_HOST_PHY_TMR_RD_CFG_REG (DR_REG_DSI_HOST_BASE + 0xf4)
/** DSI_HOST_MAX_RD_TIME : R/W; bitpos: [14:0]; default: 0;
 *  NA
 */
#define DSI_HOST_MAX_RD_TIME    0x00007FFFU
#define DSI_HOST_MAX_RD_TIME_M  (DSI_HOST_MAX_RD_TIME_V << DSI_HOST_MAX_RD_TIME_S)
#define DSI_HOST_MAX_RD_TIME_V  0x00007FFFU
#define DSI_HOST_MAX_RD_TIME_S  0

/** DSI_HOST_VID_SHADOW_CTRL_REG register
 *  NA
 */
#define DSI_HOST_VID_SHADOW_CTRL_REG (DR_REG_DSI_HOST_BASE + 0x100)
/** DSI_HOST_VID_SHADOW_EN : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define DSI_HOST_VID_SHADOW_EN    (BIT(0))
#define DSI_HOST_VID_SHADOW_EN_M  (DSI_HOST_VID_SHADOW_EN_V << DSI_HOST_VID_SHADOW_EN_S)
#define DSI_HOST_VID_SHADOW_EN_V  0x00000001U
#define DSI_HOST_VID_SHADOW_EN_S  0
/** DSI_HOST_VID_SHADOW_REQ : R/W; bitpos: [8]; default: 0;
 *  NA
 */
#define DSI_HOST_VID_SHADOW_REQ    (BIT(8))
#define DSI_HOST_VID_SHADOW_REQ_M  (DSI_HOST_VID_SHADOW_REQ_V << DSI_HOST_VID_SHADOW_REQ_S)
#define DSI_HOST_VID_SHADOW_REQ_V  0x00000001U
#define DSI_HOST_VID_SHADOW_REQ_S  8
/** DSI_HOST_VID_SHADOW_PIN_REQ : R/W; bitpos: [16]; default: 0;
 *  NA
 */
#define DSI_HOST_VID_SHADOW_PIN_REQ    (BIT(16))
#define DSI_HOST_VID_SHADOW_PIN_REQ_M  (DSI_HOST_VID_SHADOW_PIN_REQ_V << DSI_HOST_VID_SHADOW_PIN_REQ_S)
#define DSI_HOST_VID_SHADOW_PIN_REQ_V  0x00000001U
#define DSI_HOST_VID_SHADOW_PIN_REQ_S  16

/** DSI_HOST_DPI_VCID_ACT_REG register
 *  NA
 */
#define DSI_HOST_DPI_VCID_ACT_REG (DR_REG_DSI_HOST_BASE + 0x10c)
/** DSI_HOST_DPI_VCID_ACT : RO; bitpos: [1:0]; default: 0;
 *  NA
 */
#define DSI_HOST_DPI_VCID_ACT    0x00000003U
#define DSI_HOST_DPI_VCID_ACT_M  (DSI_HOST_DPI_VCID_ACT_V << DSI_HOST_DPI_VCID_ACT_S)
#define DSI_HOST_DPI_VCID_ACT_V  0x00000003U
#define DSI_HOST_DPI_VCID_ACT_S  0

/** DSI_HOST_DPI_COLOR_CODING_ACT_REG register
 *  NA
 */
#define DSI_HOST_DPI_COLOR_CODING_ACT_REG (DR_REG_DSI_HOST_BASE + 0x110)
/** DSI_HOST_DPI_COLOR_CODING_ACT : RO; bitpos: [3:0]; default: 0;
 *  NA
 */
#define DSI_HOST_DPI_COLOR_CODING_ACT    0x0000000FU
#define DSI_HOST_DPI_COLOR_CODING_ACT_M  (DSI_HOST_DPI_COLOR_CODING_ACT_V << DSI_HOST_DPI_COLOR_CODING_ACT_S)
#define DSI_HOST_DPI_COLOR_CODING_ACT_V  0x0000000FU
#define DSI_HOST_DPI_COLOR_CODING_ACT_S  0
/** DSI_HOST_LOOSELY18_EN_ACT : RO; bitpos: [8]; default: 0;
 *  NA
 */
#define DSI_HOST_LOOSELY18_EN_ACT    (BIT(8))
#define DSI_HOST_LOOSELY18_EN_ACT_M  (DSI_HOST_LOOSELY18_EN_ACT_V << DSI_HOST_LOOSELY18_EN_ACT_S)
#define DSI_HOST_LOOSELY18_EN_ACT_V  0x00000001U
#define DSI_HOST_LOOSELY18_EN_ACT_S  8

/** DSI_HOST_DPI_LP_CMD_TIM_ACT_REG register
 *  NA
 */
#define DSI_HOST_DPI_LP_CMD_TIM_ACT_REG (DR_REG_DSI_HOST_BASE + 0x118)
/** DSI_HOST_INVACT_LPCMD_TIME_ACT : RO; bitpos: [7:0]; default: 0;
 *  NA
 */
#define DSI_HOST_INVACT_LPCMD_TIME_ACT    0x000000FFU
#define DSI_HOST_INVACT_LPCMD_TIME_ACT_M  (DSI_HOST_INVACT_LPCMD_TIME_ACT_V << DSI_HOST_INVACT_LPCMD_TIME_ACT_S)
#define DSI_HOST_INVACT_LPCMD_TIME_ACT_V  0x000000FFU
#define DSI_HOST_INVACT_LPCMD_TIME_ACT_S  0
/** DSI_HOST_OUTVACT_LPCMD_TIME_ACT : RO; bitpos: [23:16]; default: 0;
 *  NA
 */
#define DSI_HOST_OUTVACT_LPCMD_TIME_ACT    0x000000FFU
#define DSI_HOST_OUTVACT_LPCMD_TIME_ACT_M  (DSI_HOST_OUTVACT_LPCMD_TIME_ACT_V << DSI_HOST_OUTVACT_LPCMD_TIME_ACT_S)
#define DSI_HOST_OUTVACT_LPCMD_TIME_ACT_V  0x000000FFU
#define DSI_HOST_OUTVACT_LPCMD_TIME_ACT_S  16

/** DSI_HOST_EDPI_TE_HW_CFG_REG register
 *  NA
 */
#define DSI_HOST_EDPI_TE_HW_CFG_REG (DR_REG_DSI_HOST_BASE + 0x11c)
/** DSI_HOST_HW_TEAR_EFFECT_ON : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define DSI_HOST_HW_TEAR_EFFECT_ON    (BIT(0))
#define DSI_HOST_HW_TEAR_EFFECT_ON_M  (DSI_HOST_HW_TEAR_EFFECT_ON_V << DSI_HOST_HW_TEAR_EFFECT_ON_S)
#define DSI_HOST_HW_TEAR_EFFECT_ON_V  0x00000001U
#define DSI_HOST_HW_TEAR_EFFECT_ON_S  0
/** DSI_HOST_HW_TEAR_EFFECT_GEN : R/W; bitpos: [1]; default: 0;
 *  NA
 */
#define DSI_HOST_HW_TEAR_EFFECT_GEN    (BIT(1))
#define DSI_HOST_HW_TEAR_EFFECT_GEN_M  (DSI_HOST_HW_TEAR_EFFECT_GEN_V << DSI_HOST_HW_TEAR_EFFECT_GEN_S)
#define DSI_HOST_HW_TEAR_EFFECT_GEN_V  0x00000001U
#define DSI_HOST_HW_TEAR_EFFECT_GEN_S  1
/** DSI_HOST_HW_SET_SCAN_LINE : R/W; bitpos: [4]; default: 0;
 *  NA
 */
#define DSI_HOST_HW_SET_SCAN_LINE    (BIT(4))
#define DSI_HOST_HW_SET_SCAN_LINE_M  (DSI_HOST_HW_SET_SCAN_LINE_V << DSI_HOST_HW_SET_SCAN_LINE_S)
#define DSI_HOST_HW_SET_SCAN_LINE_V  0x00000001U
#define DSI_HOST_HW_SET_SCAN_LINE_S  4
/** DSI_HOST_SCAN_LINE_PARAMETER : R/W; bitpos: [31:16]; default: 0;
 *  NA
 */
#define DSI_HOST_SCAN_LINE_PARAMETER    0x0000FFFFU
#define DSI_HOST_SCAN_LINE_PARAMETER_M  (DSI_HOST_SCAN_LINE_PARAMETER_V << DSI_HOST_SCAN_LINE_PARAMETER_S)
#define DSI_HOST_SCAN_LINE_PARAMETER_V  0x0000FFFFU
#define DSI_HOST_SCAN_LINE_PARAMETER_S  16

/** DSI_HOST_VID_MODE_CFG_ACT_REG register
 *  NA
 */
#define DSI_HOST_VID_MODE_CFG_ACT_REG (DR_REG_DSI_HOST_BASE + 0x138)
/** DSI_HOST_VID_MODE_TYPE_ACT : RO; bitpos: [1:0]; default: 0;
 *  NA
 */
#define DSI_HOST_VID_MODE_TYPE_ACT    0x00000003U
#define DSI_HOST_VID_MODE_TYPE_ACT_M  (DSI_HOST_VID_MODE_TYPE_ACT_V << DSI_HOST_VID_MODE_TYPE_ACT_S)
#define DSI_HOST_VID_MODE_TYPE_ACT_V  0x00000003U
#define DSI_HOST_VID_MODE_TYPE_ACT_S  0
/** DSI_HOST_LP_VSA_EN_ACT : RO; bitpos: [2]; default: 0;
 *  NA
 */
#define DSI_HOST_LP_VSA_EN_ACT    (BIT(2))
#define DSI_HOST_LP_VSA_EN_ACT_M  (DSI_HOST_LP_VSA_EN_ACT_V << DSI_HOST_LP_VSA_EN_ACT_S)
#define DSI_HOST_LP_VSA_EN_ACT_V  0x00000001U
#define DSI_HOST_LP_VSA_EN_ACT_S  2
/** DSI_HOST_LP_VBP_EN_ACT : RO; bitpos: [3]; default: 0;
 *  NA
 */
#define DSI_HOST_LP_VBP_EN_ACT    (BIT(3))
#define DSI_HOST_LP_VBP_EN_ACT_M  (DSI_HOST_LP_VBP_EN_ACT_V << DSI_HOST_LP_VBP_EN_ACT_S)
#define DSI_HOST_LP_VBP_EN_ACT_V  0x00000001U
#define DSI_HOST_LP_VBP_EN_ACT_S  3
/** DSI_HOST_LP_VFP_EN_ACT : RO; bitpos: [4]; default: 0;
 *  NA
 */
#define DSI_HOST_LP_VFP_EN_ACT    (BIT(4))
#define DSI_HOST_LP_VFP_EN_ACT_M  (DSI_HOST_LP_VFP_EN_ACT_V << DSI_HOST_LP_VFP_EN_ACT_S)
#define DSI_HOST_LP_VFP_EN_ACT_V  0x00000001U
#define DSI_HOST_LP_VFP_EN_ACT_S  4
/** DSI_HOST_LP_VACT_EN_ACT : RO; bitpos: [5]; default: 0;
 *  NA
 */
#define DSI_HOST_LP_VACT_EN_ACT    (BIT(5))
#define DSI_HOST_LP_VACT_EN_ACT_M  (DSI_HOST_LP_VACT_EN_ACT_V << DSI_HOST_LP_VACT_EN_ACT_S)
#define DSI_HOST_LP_VACT_EN_ACT_V  0x00000001U
#define DSI_HOST_LP_VACT_EN_ACT_S  5
/** DSI_HOST_LP_HBP_EN_ACT : RO; bitpos: [6]; default: 0;
 *  NA
 */
#define DSI_HOST_LP_HBP_EN_ACT    (BIT(6))
#define DSI_HOST_LP_HBP_EN_ACT_M  (DSI_HOST_LP_HBP_EN_ACT_V << DSI_HOST_LP_HBP_EN_ACT_S)
#define DSI_HOST_LP_HBP_EN_ACT_V  0x00000001U
#define DSI_HOST_LP_HBP_EN_ACT_S  6
/** DSI_HOST_LP_HFP_EN_ACT : RO; bitpos: [7]; default: 0;
 *  NA
 */
#define DSI_HOST_LP_HFP_EN_ACT    (BIT(7))
#define DSI_HOST_LP_HFP_EN_ACT_M  (DSI_HOST_LP_HFP_EN_ACT_V << DSI_HOST_LP_HFP_EN_ACT_S)
#define DSI_HOST_LP_HFP_EN_ACT_V  0x00000001U
#define DSI_HOST_LP_HFP_EN_ACT_S  7
/** DSI_HOST_FRAME_BTA_ACK_EN_ACT : RO; bitpos: [8]; default: 0;
 *  NA
 */
#define DSI_HOST_FRAME_BTA_ACK_EN_ACT    (BIT(8))
#define DSI_HOST_FRAME_BTA_ACK_EN_ACT_M  (DSI_HOST_FRAME_BTA_ACK_EN_ACT_V << DSI_HOST_FRAME_BTA_ACK_EN_ACT_S)
#define DSI_HOST_FRAME_BTA_ACK_EN_ACT_V  0x00000001U
#define DSI_HOST_FRAME_BTA_ACK_EN_ACT_S  8
/** DSI_HOST_LP_CMD_EN_ACT : RO; bitpos: [9]; default: 0;
 *  NA
 */
#define DSI_HOST_LP_CMD_EN_ACT    (BIT(9))
#define DSI_HOST_LP_CMD_EN_ACT_M  (DSI_HOST_LP_CMD_EN_ACT_V << DSI_HOST_LP_CMD_EN_ACT_S)
#define DSI_HOST_LP_CMD_EN_ACT_V  0x00000001U
#define DSI_HOST_LP_CMD_EN_ACT_S  9

/** DSI_HOST_VID_PKT_SIZE_ACT_REG register
 *  NA
 */
#define DSI_HOST_VID_PKT_SIZE_ACT_REG (DR_REG_DSI_HOST_BASE + 0x13c)
/** DSI_HOST_VID_PKT_SIZE_ACT : RO; bitpos: [13:0]; default: 0;
 *  NA
 */
#define DSI_HOST_VID_PKT_SIZE_ACT    0x00003FFFU
#define DSI_HOST_VID_PKT_SIZE_ACT_M  (DSI_HOST_VID_PKT_SIZE_ACT_V << DSI_HOST_VID_PKT_SIZE_ACT_S)
#define DSI_HOST_VID_PKT_SIZE_ACT_V  0x00003FFFU
#define DSI_HOST_VID_PKT_SIZE_ACT_S  0

/** DSI_HOST_VID_NUM_CHUNKS_ACT_REG register
 *  NA
 */
#define DSI_HOST_VID_NUM_CHUNKS_ACT_REG (DR_REG_DSI_HOST_BASE + 0x140)
/** DSI_HOST_VID_NUM_CHUNKS_ACT : RO; bitpos: [12:0]; default: 0;
 *  NA
 */
#define DSI_HOST_VID_NUM_CHUNKS_ACT    0x00001FFFU
#define DSI_HOST_VID_NUM_CHUNKS_ACT_M  (DSI_HOST_VID_NUM_CHUNKS_ACT_V << DSI_HOST_VID_NUM_CHUNKS_ACT_S)
#define DSI_HOST_VID_NUM_CHUNKS_ACT_V  0x00001FFFU
#define DSI_HOST_VID_NUM_CHUNKS_ACT_S  0

/** DSI_HOST_VID_NULL_SIZE_ACT_REG register
 *  NA
 */
#define DSI_HOST_VID_NULL_SIZE_ACT_REG (DR_REG_DSI_HOST_BASE + 0x144)
/** DSI_HOST_VID_NULL_SIZE_ACT : RO; bitpos: [12:0]; default: 0;
 *  NA
 */
#define DSI_HOST_VID_NULL_SIZE_ACT    0x00001FFFU
#define DSI_HOST_VID_NULL_SIZE_ACT_M  (DSI_HOST_VID_NULL_SIZE_ACT_V << DSI_HOST_VID_NULL_SIZE_ACT_S)
#define DSI_HOST_VID_NULL_SIZE_ACT_V  0x00001FFFU
#define DSI_HOST_VID_NULL_SIZE_ACT_S  0

/** DSI_HOST_VID_HSA_TIME_ACT_REG register
 *  NA
 */
#define DSI_HOST_VID_HSA_TIME_ACT_REG (DR_REG_DSI_HOST_BASE + 0x148)
/** DSI_HOST_VID_HSA_TIME_ACT : RO; bitpos: [11:0]; default: 0;
 *  NA
 */
#define DSI_HOST_VID_HSA_TIME_ACT    0x00000FFFU
#define DSI_HOST_VID_HSA_TIME_ACT_M  (DSI_HOST_VID_HSA_TIME_ACT_V << DSI_HOST_VID_HSA_TIME_ACT_S)
#define DSI_HOST_VID_HSA_TIME_ACT_V  0x00000FFFU
#define DSI_HOST_VID_HSA_TIME_ACT_S  0

/** DSI_HOST_VID_HBP_TIME_ACT_REG register
 *  NA
 */
#define DSI_HOST_VID_HBP_TIME_ACT_REG (DR_REG_DSI_HOST_BASE + 0x14c)
/** DSI_HOST_VID_HBP_TIME_ACT : RO; bitpos: [11:0]; default: 0;
 *  NA
 */
#define DSI_HOST_VID_HBP_TIME_ACT    0x00000FFFU
#define DSI_HOST_VID_HBP_TIME_ACT_M  (DSI_HOST_VID_HBP_TIME_ACT_V << DSI_HOST_VID_HBP_TIME_ACT_S)
#define DSI_HOST_VID_HBP_TIME_ACT_V  0x00000FFFU
#define DSI_HOST_VID_HBP_TIME_ACT_S  0

/** DSI_HOST_VID_HLINE_TIME_ACT_REG register
 *  NA
 */
#define DSI_HOST_VID_HLINE_TIME_ACT_REG (DR_REG_DSI_HOST_BASE + 0x150)
/** DSI_HOST_VID_HLINE_TIME_ACT : RO; bitpos: [14:0]; default: 0;
 *  NA
 */
#define DSI_HOST_VID_HLINE_TIME_ACT    0x00007FFFU
#define DSI_HOST_VID_HLINE_TIME_ACT_M  (DSI_HOST_VID_HLINE_TIME_ACT_V << DSI_HOST_VID_HLINE_TIME_ACT_S)
#define DSI_HOST_VID_HLINE_TIME_ACT_V  0x00007FFFU
#define DSI_HOST_VID_HLINE_TIME_ACT_S  0

/** DSI_HOST_VID_VSA_LINES_ACT_REG register
 *  NA
 */
#define DSI_HOST_VID_VSA_LINES_ACT_REG (DR_REG_DSI_HOST_BASE + 0x154)
/** DSI_HOST_VSA_LINES_ACT : RO; bitpos: [9:0]; default: 0;
 *  NA
 */
#define DSI_HOST_VSA_LINES_ACT    0x000003FFU
#define DSI_HOST_VSA_LINES_ACT_M  (DSI_HOST_VSA_LINES_ACT_V << DSI_HOST_VSA_LINES_ACT_S)
#define DSI_HOST_VSA_LINES_ACT_V  0x000003FFU
#define DSI_HOST_VSA_LINES_ACT_S  0

/** DSI_HOST_VID_VBP_LINES_ACT_REG register
 *  NA
 */
#define DSI_HOST_VID_VBP_LINES_ACT_REG (DR_REG_DSI_HOST_BASE + 0x158)
/** DSI_HOST_VBP_LINES_ACT : RO; bitpos: [9:0]; default: 0;
 *  NA
 */
#define DSI_HOST_VBP_LINES_ACT    0x000003FFU
#define DSI_HOST_VBP_LINES_ACT_M  (DSI_HOST_VBP_LINES_ACT_V << DSI_HOST_VBP_LINES_ACT_S)
#define DSI_HOST_VBP_LINES_ACT_V  0x000003FFU
#define DSI_HOST_VBP_LINES_ACT_S  0

/** DSI_HOST_VID_VFP_LINES_ACT_REG register
 *  NA
 */
#define DSI_HOST_VID_VFP_LINES_ACT_REG (DR_REG_DSI_HOST_BASE + 0x15c)
/** DSI_HOST_VFP_LINES_ACT : RO; bitpos: [9:0]; default: 0;
 *  NA
 */
#define DSI_HOST_VFP_LINES_ACT    0x000003FFU
#define DSI_HOST_VFP_LINES_ACT_M  (DSI_HOST_VFP_LINES_ACT_V << DSI_HOST_VFP_LINES_ACT_S)
#define DSI_HOST_VFP_LINES_ACT_V  0x000003FFU
#define DSI_HOST_VFP_LINES_ACT_S  0

/** DSI_HOST_VID_VACTIVE_LINES_ACT_REG register
 *  NA
 */
#define DSI_HOST_VID_VACTIVE_LINES_ACT_REG (DR_REG_DSI_HOST_BASE + 0x160)
/** DSI_HOST_V_ACTIVE_LINES_ACT : RO; bitpos: [13:0]; default: 0;
 *  NA
 */
#define DSI_HOST_V_ACTIVE_LINES_ACT    0x00003FFFU
#define DSI_HOST_V_ACTIVE_LINES_ACT_M  (DSI_HOST_V_ACTIVE_LINES_ACT_V << DSI_HOST_V_ACTIVE_LINES_ACT_S)
#define DSI_HOST_V_ACTIVE_LINES_ACT_V  0x00003FFFU
#define DSI_HOST_V_ACTIVE_LINES_ACT_S  0

