espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/mipi_dsi_host_reg.h
/** DSI_HOST_VID_PKT_STATUS_REG register
 *  NA
 */
#define DSI_HOST_VID_PKT_STATUS_REG (DR_REG_DSI_HOST_BASE + 0x168)
/** DSI_HOST_DPI_CMD_W_EMPTY : RO; bitpos: [0]; default: 1;
 *  NA
 */
#define DSI_HOST_DPI_CMD_W_EMPTY    (BIT(0))
#define DSI_HOST_DPI_CMD_W_EMPTY_M  (DSI_HOST_DPI_CMD_W_EMPTY_V << DSI_HOST_DPI_CMD_W_EMPTY_S)
#define DSI_HOST_DPI_CMD_W_EMPTY_V  0x00000001U
#define DSI_HOST_DPI_CMD_W_EMPTY_S  0
/** DSI_HOST_DPI_CMD_W_FULL : RO; bitpos: [1]; default: 0;
 *  NA
 */
#define DSI_HOST_DPI_CMD_W_FULL    (BIT(1))
#define DSI_HOST_DPI_CMD_W_FULL_M  (DSI_HOST_DPI_CMD_W_FULL_V << DSI_HOST_DPI_CMD_W_FULL_S)
#define DSI_HOST_DPI_CMD_W_FULL_V  0x00000001U
#define DSI_HOST_DPI_CMD_W_FULL_S  1
/** DSI_HOST_DPI_PLD_W_EMPTY : RO; bitpos: [2]; default: 1;
 *  NA
 */
#define DSI_HOST_DPI_PLD_W_EMPTY    (BIT(2))
#define DSI_HOST_DPI_PLD_W_EMPTY_M  (DSI_HOST_DPI_PLD_W_EMPTY_V << DSI_HOST_DPI_PLD_W_EMPTY_S)
#define DSI_HOST_DPI_PLD_W_EMPTY_V  0x00000001U
#define DSI_HOST_DPI_PLD_W_EMPTY_S  2
/** DSI_HOST_DPI_PLD_W_FULL : RO; bitpos: [3]; default: 0;
 *  NA
 */
#define DSI_HOST_DPI_PLD_W_FULL    (BIT(3))
#define DSI_HOST_DPI_PLD_W_FULL_M  (DSI_HOST_DPI_PLD_W_FULL_V << DSI_HOST_DPI_PLD_W_FULL_S)
#define DSI_HOST_DPI_PLD_W_FULL_V  0x00000001U
#define DSI_HOST_DPI_PLD_W_FULL_S  3
/** DSI_HOST_DPI_BUFF_PLD_EMPTY : RO; bitpos: [16]; default: 1;
 *  NA
 */
#define DSI_HOST_DPI_BUFF_PLD_EMPTY    (BIT(16))
#define DSI_HOST_DPI_BUFF_PLD_EMPTY_M  (DSI_HOST_DPI_BUFF_PLD_EMPTY_V << DSI_HOST_DPI_BUFF_PLD_EMPTY_S)
#define DSI_HOST_DPI_BUFF_PLD_EMPTY_V  0x00000001U
#define DSI_HOST_DPI_BUFF_PLD_EMPTY_S  16
/** DSI_HOST_DPI_BUFF_PLD_FULL : RO; bitpos: [17]; default: 0;
 *  NA
 */
#define DSI_HOST_DPI_BUFF_PLD_FULL    (BIT(17))
#define DSI_HOST_DPI_BUFF_PLD_FULL_M  (DSI_HOST_DPI_BUFF_PLD_FULL_V << DSI_HOST_DPI_BUFF_PLD_FULL_S)
#define DSI_HOST_DPI_BUFF_PLD_FULL_V  0x00000001U
#define DSI_HOST_DPI_BUFF_PLD_FULL_S  17

/** DSI_HOST_SDF_3D_ACT_REG register
 *  NA
 */
#define DSI_HOST_SDF_3D_ACT_REG (DR_REG_DSI_HOST_BASE + 0x190)
/** DSI_HOST_MODE_3D_ACT : RO; bitpos: [1:0]; default: 0;
 *  NA
 */
#define DSI_HOST_MODE_3D_ACT    0x00000003U
#define DSI_HOST_MODE_3D_ACT_M  (DSI_HOST_MODE_3D_ACT_V << DSI_HOST_MODE_3D_ACT_S)
#define DSI_HOST_MODE_3D_ACT_V  0x00000003U
#define DSI_HOST_MODE_3D_ACT_S  0
/** DSI_HOST_FORMAT_3D_ACT : RO; bitpos: [3:2]; default: 0;
 *  NA
 */
#define DSI_HOST_FORMAT_3D_ACT    0x00000003U
#define DSI_HOST_FORMAT_3D_ACT_M  (DSI_HOST_FORMAT_3D_ACT_V << DSI_HOST_FORMAT_3D_ACT_S)
#define DSI_HOST_FORMAT_3D_ACT_V  0x00000003U
#define DSI_HOST_FORMAT_3D_ACT_S  2
/** DSI_HOST_SECOND_VSYNC_ACT : RO; bitpos: [4]; default: 0;
 *  NA
 */
#define DSI_HOST_SECOND_VSYNC_ACT    (BIT(4))
#define DSI_HOST_SECOND_VSYNC_ACT_M  (DSI_HOST_SECOND_VSYNC_ACT_V << DSI_HOST_SECOND_VSYNC_ACT_S)
#define DSI_HOST_SECOND_VSYNC_ACT_V  0x00000001U
#define DSI_HOST_SECOND_VSYNC_ACT_S  4
/** DSI_HOST_RIGHT_FIRST_ACT : RO; bitpos: [5]; default: 0;
 *  NA
 */
#define DSI_HOST_RIGHT_FIRST_ACT    (BIT(5))
#define DSI_HOST_RIGHT_FIRST_ACT_M  (DSI_HOST_RIGHT_FIRST_ACT_V << DSI_HOST_RIGHT_FIRST_ACT_S)
#define DSI_HOST_RIGHT_FIRST_ACT_V  0x00000001U
#define DSI_HOST_RIGHT_FIRST_ACT_S  5
/** DSI_HOST_SEND_3D_CFG_ACT : RO; bitpos: [16]; default: 0;
 *  NA
 */
#define DSI_HOST_SEND_3D_CFG_ACT    (BIT(16))
#define DSI_HOST_SEND_3D_CFG_ACT_M  (DSI_HOST_SEND_3D_CFG_ACT_V << DSI_HOST_SEND_3D_CFG_ACT_S)
#define DSI_HOST_SEND_3D_CFG_ACT_V  0x00000001U
#define DSI_HOST_SEND_3D_CFG_ACT_S  16

#ifdef __cplusplus
}
#endif
